{
  "file": "/Users/jethroestrada/Desktop/External_Projects/Jet_Projects/JetScripts/features/generated/run_search_and_rerank/searched_html_myanimelist_net_Isekai/context.md",
  "header_count": 133,
  "min_tokens": 32,
  "max_tokens": 335,
  "headers": [
    {
      "tokens": 133,
      "text": "# Isekai Anime\nTop\n>\nAnime\n>\nIsekai\n* Upcoming\n* Just Added\n* #\n* A\n* B\n* C\n* D\n* E\n* F\n* G\n* H\n* I\n* J\n* K\n* L\n* M\n* N\n* O\n* P\n* Q\n* R\n* S\n* T\n* U\n* V\n* W\n* X\n* Y\n* Z\nAdvanced Search\nView all results for ${ keyword }\n* All\n* Not In My List\n* Watching\n* Completed\n* On-Hold\n* Dropped\n* Plan to Watch\nSorted by Members\nMembers\nScore\nNewest\nTitle\nIsekai Anime (429)",
      "metadata": {
        "doc_index": 0,
        "header_level": 1,
        "header": "# Isekai Anime",
        "parent_header": null
      }
    },
    {
      "tokens": 133,
      "text": "## No Game No Life\nTV, 2014 Finished 12 eps, 23 min\nComedy Fantasy Ecchi\nNo Game No Life\nSixteen sentient races inhabit Disboard, a world overseen by Tet, the One True God.\nThe lowest of the sixteen--Imanity--consists of humans, a race with no affinity for magic.\nIn a place where everything is decided through simple games, humankind seems to have no way out of their predicament--but the arrival of two outsiders poses a change.\nOn Earth, stepsiblings Sora and Shiro are two inseparable shut-ins who dominate various online games under the username \"Blank.\"",
      "metadata": {
        "doc_index": 1,
        "header_level": 2,
        "header": "## No Game No Life",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## No Game No Life - 5 While notorious on the internet, the pair believe that life is merely another dull game.\nHowever, after responding to a message from an unknown user, they are suddenly transported to Disboard.\nThe mysterious sender turns out to be Tet, who informs them about the world's absolute rules.\nAfter Tet leaves, Sora and Shiro begin their search for more information and a place to stay, taking them to Elkia--Imanity's only remaining kingdom.\nThere, the duo encounters Stephanie Dola, an emotional girl vying for the kingdom's sovereignty.\nIn desperation, she attempts to regain her father's throne, but her foolhardiness makes her goal unachievable.\nInspired by the girl's motivation and passion, Sora and Shiro decide to aid Stephanie in getting Elkia back on its feet, ultimately aiming to become the new rulers of the enigmatic realm.\n[Written by MAL Rewrite]\nStudio Madhouse\nSource Light novel\nThemes Isekai Strategy Game\n8.05\n2.5M\nAdd to My List",
      "metadata": {
        "doc_index": 2,
        "header_level": 2,
        "header": "## No Game No Life - 5 While notorious on the internet, the pair believe that life is merely another dull game.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Re:Zero kara Hajimeru Isekai Seikatsu\nTV, 2016 Finished 25 eps, 26 min\nDrama Fantasy Suspense\nRe:Zero kara Hajimeru Isekai Seikatsu\nWhen Subaru Natsuki leaves the convenience store, the last thing he expects is to be wrenched from his everyday life and dropped into a fantasy world.",
      "metadata": {
        "doc_index": 3,
        "header_level": 2,
        "header": "## Re:Zero kara Hajimeru Isekai Seikatsu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Re:Zero kara Hajimeru Isekai Seikatsu - 2 Things are not looking good for the bewildered teenager; however, not long after his arrival, he is attacked by some thugs.\nArmed with only a bag of groceries and a now useless cell phone, he is quickly beaten to a pulp.\nFortunately, a mysterious beauty named Satella, in hot pursuit after the one who stole her insignia, happens upon Subaru and saves him.\nIn order to thank the honest and kindhearted girl, Subaru offers to help in her search, and later that night, he even finds the whereabouts of that which she seeks.\nBut unbeknownst to them, a much darker force stalks the pair from the shadows, and just minutes after locating the insignia, Subaru and Satella are brutally murdered.\nHowever, Subaru immediately reawakens to a familiar scene--confronted by the same group of thugs, meeting Satella all over again--the enigma deepens as history inexplicably repeats itself.\n[Written by MAL Rewrite]\nStudio White Fox\nSource Light novel\nThemes Isekai Psychological Time Travel\n8.24\n2.3M\nAdd to My List",
      "metadata": {
        "doc_index": 4,
        "header_level": 2,
        "header": "## Re:Zero kara Hajimeru Isekai Seikatsu - 2 Things are not looking good for the bewildered teenager; however, not long after his arrival, he is attacked by some thugs.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kono Subarashii Sekai ni Shukufuku wo!\nTV, 2016 Finished 10 eps, 23 min\nAdventure Comedy Fantasy\nKono Subarashii Sekai ni Shukufuku wo!\nAfter dying a laughable and pathetic death on his way back from buying a game, high school student and recluse Kazuma Satou finds himself sitting before a beautiful but obnoxious goddess named Aqua. She provides the NEET with two options: continue on to heaven or reincarnate in every gamer's dream--a real fantasy world! Choosing to start a new life, Kazuma is quickly tasked with defeating a Demon King who is terrorizing villages. But before he goes, he can choose one item of any kind to aid him in his quest, and the future hero selects Aqua. But Kazuma has made a grave mistake--Aqua is completely useless! Unfortunately, their troubles don't end here; it turns out that living in such a world is far different from how it plays out in a game. Instead of going on a thrilling adventure, the duo must first work to pay for their living expenses. Indeed, their misfortunes have only just begun! [Written by MAL Rewrite]\nStudio Studio Deen\nSource Light novel\nThemes Isekai Parody\n8.10\n2.1M\nAdd to My List",
      "metadata": {
        "doc_index": 5,
        "header_level": 2,
        "header": "## Kono Subarashii Sekai ni Shukufuku wo!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tate no Yuusha no Nariagari - 1 ## Tate no Yuusha no Nariagari\nTV, 2019 Finished 25 eps, 24 min\nAction Adventure Drama Fantasy\nTate no Yuusha no Nariagari\nThe Four Cardinal Heroes are a group of ordinary men from modern-day Japan summoned to the kingdom of Melromarc to become its saviors.\nMelromarc is a country plagued by the Waves of Catastrophe that have repeatedly ravaged the land and brought disaster to its citizens for centuries.\nThe four heroes are respectively bestowed a sword, spear, bow, and shield to vanquish these Waves.\nNaofumi Iwatani, an otaku, becomes cursed with the fate of being the \"Shield Hero.\"\nArmed with only a measly shield, Naofumi is belittled and ridiculed by his fellow heroes and the kingdom's people due to his weak offensive capabilities and lackluster personality.\nWhen the heroes are provided with resources and comrades to train with, Naofumi sets out with the only person willing to train alongside him, Malty Melromarc.\nHe is soon betrayed by her, however, and becomes falsely accused of taking advantage of her.\nNaofumi then becomes heavily discriminated against and hated by the people of Melromarc for something he didn't do.\nWith a raging storm of hurt and mistrust in his heart, Naofumi begins his journey of strengthening himself and his reputation.",
      "metadata": {
        "doc_index": 6,
        "header_level": 2,
        "header": "## Tate no Yuusha no Nariagari - 1 ## Tate no Yuusha no Nariagari",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tate no Yuusha no Nariagari - 10 Further along however, the difficulty of being on his own sets in, so Naofumi buys a demi-human slave on the verge of death named Raphtalia to accompany him on his travels.\nAs the Waves approach the kingdom, Naofumi and Raphtalia must fight for the survival of the kingdom and protect the people of Melromarc from their ill-fated future.\n[Written by MAL Rewrite]\nStudio Kinema Citrus\nSource Light novel\nTheme Isekai\n7.93\n1.7M\nAdd to My List",
      "metadata": {
        "doc_index": 7,
        "header_level": 2,
        "header": "## Tate no Yuusha no Nariagari - 10 Further along however, the difficulty of being on his own sets in, so Naofumi buys a demi-human slave on the verge of death named Raphtalia to accompany him on his travels.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Overlord\nTV, 2015 Finished 13 eps, 24 min\nAction Adventure Fantasy\nOverlord\nThe final hour of the popular virtual reality game Yggdrasil has come. However, Momonga, a powerful wizard and master of the dark guild Ainz Ooal Gown, decides to spend his last few moments in the game as the servers begin to shut down. To his surprise, despite the clock having struck midnight, Momonga is still fully conscious as his character and, moreover, the non-player characters appear to have developed personalities of their own! Confronted with this abnormal situation, Momonga commands his loyal servants to help him investigate and take control of this new world, with the hopes of figuring out what has caused this development and if there may be others in the same predicament. [Written by MAL Rewrite]\nStudio Madhouse\nSource Light novel\nTheme Isekai\n7.90\n1.7M\nAdd to My List",
      "metadata": {
        "doc_index": 8,
        "header_level": 2,
        "header": "## Overlord",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kono Subarashii Sekai ni Shukufuku wo!\n2\nTV, 2017 Finished 10 eps, 23 min\nAdventure Comedy Fantasy\nKono Subarashii Sekai ni Shukufuku wo!\n2\nWhen Kazuma Satou died, he was given two choices: pass on to heaven or be revived in a fantasy world.",
      "metadata": {
        "doc_index": 9,
        "header_level": 2,
        "header": "## Kono Subarashii Sekai ni Shukufuku wo!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kono Subarashii Sekai ni Shukufuku wo! 2 - 4 After choosing the new world, the goddess Aqua tasked him with defeating the Demon King, and let him choose any weapon to aid him.\nUnfortunately, Kazuma chose to bring Aqua herself and has regretted the decision ever since then.\nNot only is he stuck with a useless deity turned party archpriest, the pair also has to make enough money for living expenses.\nTo add to their problems, their group continued to grow as more problematic adventurers joined their ranks.\nTheir token spellcaster, Megumin, is an explosion magic specialist who can only cast one spell once per day and refuses to learn anything else.\nThere is also their stalwart crusader, Lalatina Ford \"Darkness\" Dustiness, a helpless masochist who makes Kazuma look pure in comparison.\nKono Subarashii Sekai ni Shukufuku wo!\n2 continues to follow Kazuma and the rest of his party through countless more adventures as they struggle to earn money and have to deal with one another's problematic personalities.\nHowever, things rarely go as planned, and they are often sidetracked by their own idiotic tendencies.\n[Written by MAL Rewrite]\nStudio Studio Deen\nSource Light novel\nThemes Isekai Parody\n8.25\n1.6M\nAdd to My List",
      "metadata": {
        "doc_index": 10,
        "header_level": 2,
        "header": "## Kono Subarashii Sekai ni Shukufuku wo! 2 - 4 After choosing the new world, the goddess Aqua tasked him with defeating the Demon King, and let him choose any weapon to aid him.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Slime Datta Ken - 1 ## Tensei shitara Slime Datta Ken\nTV, 2018 Finished 24 eps, 23 min\nAction Comedy Fantasy\nTensei shitara Slime Datta Ken\nThirty-seven-year-old Satoru Mikami is a typical corporate worker, who is perfectly content with his monotonous lifestyle in Tokyo, other than failing to nail down a girlfriend even once throughout his life.\nIn the midst of a casual encounter with his colleague, he falls victim to a random assailant on the streets and is stabbed.\nHowever, while succumbing to his injuries, a peculiar voice echoes in his mind, and recites a bunch of commands which the dying man cannot make sense of.\nWhen Satoru regains consciousness, he discovers that he has reincarnated as a goop of slime in an unfamiliar realm.\nIn doing so, he acquires newfound skills--notably, the power to devour anything and mimic its appearance and abilities.\nHe then stumbles upon the sealed Catastrophe-level monster \"Storm Dragon\" Veldora who had been sealed away for the past 300 years for devastating a town to ashes.\nSympathetic to his predicament, Satoru befriends him, promising to assist in destroying the seal.\nIn return, Veldora bestows upon him the name Rimuru Tempest to grant him divine protection.",
      "metadata": {
        "doc_index": 11,
        "header_level": 2,
        "header": "## Tensei shitara Slime Datta Ken - 1 ## Tensei shitara Slime Datta Ken",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Slime Datta Ken - 9 Now, liberated from the mundanities of his past life, Rimuru embarks on a fresh journey with a distinct goal in mind.\nAs he grows accustomed to his new physique, his gooey antics ripple throughout the world, gradually altering his fate.\n[Written by MAL Rewrite]\nStudio 8bit\nSource Manga\nThemes Isekai Reincarnation\nDemographic Shounen\n8.14\n1.6M\nAdd to My List",
      "metadata": {
        "doc_index": 12,
        "header_level": 2,
        "header": "## Tensei shitara Slime Datta Ken - 9 Now, liberated from the mundanities of his past life, Rimuru embarks on a fresh journey with a distinct goal in mind.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei: Isekai Ittara Honki Dasu\nTV, 2021 Finished 11 eps, 23 min\nAdventure Drama Fantasy Ecchi\nMushoku Tensei: Isekai Ittara Honki Dasu\nDespite being bullied, scorned, and oppressed all of his life, a 34-year-old shut-in still found the resolve to attempt something heroic--only for it to end in a tragic accident.\nBut in a twist of fate, he awakens in another world as Rudeus Greyrat, starting life again as a baby born to two loving parents.\nPreserving his memories and knowledge from his previous life, Rudeus quickly adapts to his new environment.\nWith the mind of a grown adult, he starts to display magical talent that exceeds all expectations, honing his skill with the help of a mage named Roxy Migurdia.",
      "metadata": {
        "doc_index": 13,
        "header_level": 2,
        "header": "## Mushoku Tensei: Isekai Ittara Honki Dasu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei: Isekai Ittara Honki Dasu - 5 Rudeus learns swordplay from his father, Paul, and meets Sylphiette, a girl his age who quickly becomes his closest friend.\nAs Rudeus' second chance at life begins, he tries to make the most of his new opportunity while conquering his traumatic past.\nAnd perhaps, one day, he may find the one thing he could not find in his old world--love.\n[Written by MAL Rewrite]\nStudio Studio Bind\nSource Light novel\nThemes Isekai Reincarnation\n8.35\n1.5M\nAdd to My List",
      "metadata": {
        "doc_index": 14,
        "header_level": 2,
        "header": "## Mushoku Tensei: Isekai Ittara Honki Dasu - 5 Rudeus learns swordplay from his father, Paul, and meets Sylphiette, a girl his age who quickly becomes his closest friend.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season\nTV, 2020 Finished 13 eps, 26 min\nDrama Fantasy Suspense\nRe:Zero kara Hajimeru Isekai Seikatsu 2nd Season\nA reunion that was supposed to spell the arrival of peaceful times is quickly shattered when Subaru Natsuki and Emilia return to Irlam village. Witnessing the devastation left behind by the calamities known as Sin Archbishops, Subaru sinks into the depths of despair as his ability to redo proves futile. As the group makes their way to the Sanctuary in search of answers, Subaru has an unexpected encounter with the Witch of Greed--Echidna. Subjected to her untamed rhythm, he is forced to dive into the spirals of the past and future. At the same time, several mysterious threats set their sights on the Sanctuary, heralding a horrific fate for the hapless people trapped within. Everlasting contracts, past sins, and unrequited love will clash and submerge into a river of blood in the second season of Re:Zero kara Hajimeru Isekai Seikatsu. Pushed to the brink of hopelessness, how long will Subaru's resolve to save his loved ones last? [Written by MAL Rewrite]\nStudio White Fox\nSource Light novel\nThemes Isekai Psychological Time Travel\n8.33\n1.2M\nAdd to My List",
      "metadata": {
        "doc_index": 15,
        "header_level": 2,
        "header": "## Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Overlord II\nTV, 2018 Finished 13 eps, 23 min\nAction Adventure Fantasy\nOverlord II\nAinz Ooal Gown, the undead sorcerer formerly known as Momonga, has accepted his place in this new world. Though it bears similarities to his beloved virtual reality game Yggdrasil, it still holds many mysteries which he intends to uncover, by utilizing his power as ruler of the Great Tomb of Nazarick. However, ever since the disastrous brainwashing of one of his subordinates, Ainz has become wary of the impending dangers of the Slane Theocracy, as well as the possible existence of other former Yggdrasil players. Meanwhile, Albedo, Demiurge and the rest of Ainz's loyal guardians set out to prepare for the next step in their campaign: Nazarick's first war... Overlord II picks up immediately after its prequel, continuing the story of Ainz Ooal Gown, his eclectic army of human-hating guardians, and the many hapless humans affected by the Overlord's arrival. [Written by MAL Rewrite]\nStudio Madhouse\nSource Light novel\nTheme Isekai\n7.75\n1.1M\nAdd to My List",
      "metadata": {
        "doc_index": 16,
        "header_level": 2,
        "header": "## Overlord II",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Slime Datta Ken 2nd Season\nTV, 2021 Finished 12 eps, 23 min\nAction Comedy Fantasy\nTensei shitara Slime Datta Ken 2nd Season\nTaking a break from his time as a teacher, the powerful slime Rimuru Tempest returns to his kingdom, eponymously named Tempest, just in time to begin negotiations with a nearby nation--the Kingdom of Eurazania. While the negotiations are anything but peaceful, they do end successfully, allowing Rimuru to return and finish teaching. When trying to again return to Tempest, this time permanently, Rimuru is stopped by a mysterious figure who is somehow able to constrain the many magical abilities he has at his disposal. In Tempest, the situation is even worse. A group of unknown humans has invaded the land and are assaulting its citizens, both influential and innocent. They are not just trying to bring harm either--they have the intent to kill. Can Rimuru overcome his powerful and dangerous foe and return to Tempest before it is too late? [Written by MAL Rewrite]\nStudio 8bit\nSource Manga\nThemes Isekai Reincarnation\nDemographic Shounen\n8.36\n1.0M\nAdd to My List",
      "metadata": {
        "doc_index": 17,
        "header_level": 2,
        "header": "## Tensei shitara Slime Datta Ken 2nd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei: Isekai Ittara Honki Dasu Part 2\nTV, 2021 Finished 12 eps, 23 min\nAdventure Drama Fantasy Ecchi\nMushoku Tensei: Isekai Ittara Honki Dasu Part 2\nAfter the mysterious mana calamity, Rudeus Greyrat and his fierce student Eris Boreas Greyrat are teleported to the Demon Continent. There, they team up with their newfound companion Ruijerd Supardia--the former leader of the Superd's Warrior group--to form \"Dead End,\" a successful adventurer party. Making a name for themselves, the trio journeys across the continent to make their way back home to Fittoa. Following the advice he received from the faceless god Hitogami, Rudeus saves Kishirika Kishirisu, the Great Emperor of the Demon World, who rewards him by granting him a strange power. Now, as Rudeus masters the powerful ability that offers a number of new opportunities, it might prove to be more than what he bargained for when unexpected dangers threaten to hinder their travels. [Written by MAL Rewrite]\nStudio Studio Bind\nSource Light novel\nThemes Isekai Reincarnation\n8.64\n1.0M\nAdd to My List",
      "metadata": {
        "doc_index": 18,
        "header_level": 2,
        "header": "## Mushoku Tensei: Isekai Ittara Honki Dasu Part 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season Part 2\nTV, 2021 Finished 12 eps, 29 min\nDrama Fantasy Suspense\nRe:Zero kara Hajimeru Isekai Seikatsu 2nd Season Part 2\nAfter a stern yet compelling speech by Otto Suwen, Subaru Natsuki solemnly swears that he will successfully make it through this timeline and save everyone he can along the way. The first step toward achieving this goal is to help Emilia work through her past; however, that is easier said than done. Feeling as if she has been lied to by everyone around her, it will be difficult for Emilia to trust anyone, even Subaru, her self-proclaimed knight. Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season Part 2 presents the culmination of Subaru's experiences with the Sanctuary and its people, along with his unwillingness to give up hope on saving them. [Written by MAL Rewrite]\nStudio White Fox\nSource Light novel\nThemes Isekai Psychological Time Travel\n8.43\n990K\nAdd to My List",
      "metadata": {
        "doc_index": 19,
        "header_level": 2,
        "header": "## Re:Zero kara Hajimeru Isekai Seikatsu 2nd Season Part 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Youjo Senki\nTV, 2017 Finished 12 eps, 23 min\nAction Fantasy\nYoujo Senki\nTanya Degurechaff is a young soldier infamous for predatorial-like ruthlessness and an uncanny, tactical aptitude, earning her the nickname of the \"Devil of the Rhine.\" Underneath her innocuous appearance, however, lies the soul of a man who challenged Being X, the self-proclaimed God, to a battle of wits--which resulted in him being reincarnated as a little girl into a world of magical warfare. Hellbent on defiance, Tanya resolves to ascend the ranks of her country's military as it slowly plunges into world war, with only Being X proving to be the strongest obstacle in recreating the peaceful life she once knew. But her perceptive actions and combat initiative have an unintended side effect: propelling the mighty Empire into becoming one of the most powerful nations in mankind's history. [Written by MAL Rewrite]\nStudio Nut\nSource Light novel\nThemes Isekai Military Reincarnation\n7.96\n988K\nAdd to My List",
      "metadata": {
        "doc_index": 20,
        "header_level": 2,
        "header": "## Youjo Senki",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Overlord III\nTV, 2018 Finished 13 eps, 23 min\nAction Adventure Fantasy\nOverlord III\nFollowing the horrific assault on the Re-Estize capital city, the Guardians of the Great Tomb of Nazarick return home to their master Ainz Ooal Gown. After months of laying the groundwork, they are finally ready to set their plans of world domination into action. As Ainz's war machine gathers strength, the rest of the world keeps moving. The remote Carne Village, which Ainz once saved from certain doom, continues to prosper despite the many threats on its doorstep. And in the northeastern Baharuth Empire, a certain Bloody Emperor sets his sights on the rising power of Nazarick. Blood is shed, heroes fall, and nations rise. Can anyone, or anything, challenge the supreme power of Ainz Ooal Gown? [Written by MAL Rewrite]\nStudio Madhouse\nSource Light novel\nTheme Isekai\n7.91\n968K\nAdd to My List",
      "metadata": {
        "doc_index": 21,
        "header_level": 2,
        "header": "## Overlord III",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## No Game No Life: Zero\nMovie, 2017 Finished 1 ep, 106 min\nDrama Fantasy Romance\nNo Game No Life: Zero\nIn ancient Disboard, Riku is an angry, young warrior intent on saving humanity from the warring Exceed, the 16 sentient species, fighting to establish the One True God among the Old Deus. In a lawless land, humanity's lack of magic and weak bodies have made them easy targets for the other Exceed, leaving the humans on the brink of extinction. One day, however, hope returns to humanity when Riku finds a powerful female Ex-Machina, whom he names Schwi, in an abandoned elf city. Exiled from her Cluster because of her research into human emotions, Schwi is convinced that humanity has only survived due to the power of these feelings and is determined to understand the human heart. Forming an unlikely partnership in the midst of the overwhelming chaos, Riku and Schwi must now find the answers to their individual shortcomings in each other, and discover for themselves what it truly means to be human as they fight for their lives together against all odds. Each with a powerful new ally in tow, it is now up to them to prevent the extinction of the human race and establish peace throughout Disboard. [Written by MAL Rewrite]\nStudio Madhouse\nSource Light novel\nTheme Isekai\n8.17\n920K\nAdd to My List",
      "metadata": {
        "doc_index": 22,
        "header_level": 2,
        "header": "## No Game No Life: Zero",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Gate: Jieitai Kanochi nite, Kaku Tatakaeri\nTV, 2015 Finished 12 eps, 23 min\nAction Adventure Fantasy\nGate: Jieitai Kanochi nite, Kaku Tatakaeri\nOff-duty Japan Self-Defense Forces (JSDF) officer and otaku Youji Itami is on his way to attend a doujin convention in Ginza, Tokyo when a mysterious portal in the shape of a large gate suddenly appears. From this gate, supernatural creatures and warriors clad in medieval armor emerge, charging through the city, killing and destroying everything in their path. With swift actions, Youji saves as many lives as he can while the rest of the JSDF direct their efforts toward stopping the invasion. Three months after the attack, Youji has been tasked with leading a special recon team, as part of a JSDF task force, that will be sent to the world beyond the gate--now being referred to as the \"Special Region.\" They must travel into this unknown world in order to learn more about what they are dealing with and attempt to befriend the locals in hopes of creating peaceful ties with the ruling empire. But if they fail, they face the consequence of participating in a devastating war that will engulf both sides of the gate. [Written by MAL Rewrite]\nStudio A-1 Pictures\nSource Light novel\nThemes Isekai Military\n7.68\n850K\nAdd to My List",
      "metadata": {
        "doc_index": 23,
        "header_level": 2,
        "header": "## Gate: Jieitai Kanochi nite, Kaku Tatakaeri",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Slime Datta Ken 2nd Season Part 2\nTV, 2021 Finished 12 eps, 23 min\nAction Comedy Fantasy\nTensei shitara Slime Datta Ken 2nd Season Part 2\nThe nation of Tempest is in a festive mood after successfully overcoming the surprise attack from the Falmuth Army and the Western Holy Church. Beyond the festivities lies a meeting between Tempest and its allies to decide the future of the Nation of Monsters. The aftermath of the Falmuth invasion, Milim Nava's suspicious behavior, and the disappearance of Demon Lord Carrion--the problems seem to keep on piling up. Rimuru Tempest, now awakened as a True Demon Lord, decides to go on the offensive against Clayman. With the fully revived Storm Dragon Veldora, Ultimate Skill Raphael, and other powerful comrades, the ruler of the Tempest is confident in taking down his enemies one by one until he can face the man pulling the strings. [Written by MAL Rewrite]\nStudio 8bit\nSource Manga\nThemes Isekai Reincarnation\nDemographic Shounen\n8.31\n849K\nAdd to My List",
      "metadata": {
        "doc_index": 24,
        "header_level": 2,
        "header": "## Tensei shitara Slime Datta Ken 2nd Season Part 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Zero no Tsukaima\nTV, 2006 Finished 13 eps, 23 min\nAction Adventure Comedy Fantasy Romance Ecchi\nZero no Tsukaima\nLouise Francoise Le Blanc de La Valliere is a self-absorbed mage in a world of wands, cloaks, and royalty. Although she studies at Tristain Academy, a prestigious school for magicians, she has a major problem: Louise is unable to cast magic properly, earning her the nickname of \"Louise the Zero\" from her classmates. When the first year students are required to perform a summoning ritual, Louise's summoning results in a catastrophic explosion! Everyone deems this to be yet another failure, but when the smoke clears, a boy named Saito Hiraga appears. Now Louise's familiar, Saito is treated as a slave, forced to clean her clothes and eat off the ground. But when an unfamiliar brand is found etched on Saito's hand from the summoning ritual, it is believed to be the mark of a powerful familiar named Gandalfr. Wild, adventurous, and explosive, Zero no Tsukaima follows Saito as he comes to terms with his new life and as Louise proves that there is more to her than her nickname suggests. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nThemes Harem Isekai School\n7.21\n847K\nAdd to My List",
      "metadata": {
        "doc_index": 25,
        "header_level": 2,
        "header": "## Zero no Tsukaima",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kono Subarashii Sekai ni Shukufuku wo! Movie: Kurenai Densetsu\nMovie, 2019 Finished 1 ep, 90 min\nAdventure Comedy Fantasy\nKono Subarashii Sekai ni Shukufuku wo! Movie: Kurenai Densetsu\nIt is not strange that the Demon Lord's forces fear the Crimson Demons, the clan from which Megumin and Yunyun originate. Even if the Demon Lord's generals attack their village, the Crimson Demons can just easily brush them off with their supreme mastery of advanced and overpowered magic. When Yunyun receives a seemingly serious letter regarding a potential disaster coming to her hometown, she immediately informs Kazuma Satou and the rest of his party. After a series of wacky misunderstandings, it turns out to be a mere prank by her fellow demon who wants to be an author. Even so, Megumin becomes worried about her family and sets out toward the Crimson Demons' village with the gang. There, Kazuma and the others decide to sightsee the wonders of Megumin's birthplace. However, they soon come to realize that the nonsense threat they received might have been more than just a joke. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nThemes Isekai Parody\n8.41\n842K\nAdd to My List",
      "metadata": {
        "doc_index": 26,
        "header_level": 2,
        "header": "## Kono Subarashii Sekai ni Shukufuku wo! Movie: Kurenai Densetsu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tate no Yuusha no Nariagari Season 2\nTV, 2022 Finished 13 eps, 23 min\nAction Adventure Drama Fantasy\nTate no Yuusha no Nariagari Season 2\nWith another Wave happening in a week, Naofumi Iwatani and his party have no time to waste. However, when bat familiars raid Lurolona Village and the Wave countdown comes to a halt, the Four Cardinal Heroes reconvene with the queen, Mirelia Q Melromarc, for a quick briefing. The queen presumes that the odd occurrences are linked to the Spirit Tortoise--a threatening creature that has awakened from its slumber, back to cause havoc once again. A plan to put the Spirit Tortoise to rest is devised--but out of the four men, only the cursed Shield Hero agrees to help. [Written by MAL Rewrite]\nStudios DR Movie Kinema Citrus\nSource Light novel\nTheme Isekai\n6.52\n820K\nAdd to My List",
      "metadata": {
        "doc_index": 27,
        "header_level": 2,
        "header": "## Tate no Yuusha no Nariagari Season 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Hai to Gensou no Grimgar\nTV, 2016 Finished 12 eps, 24 min\nAction Adventure Drama Fantasy\nHai to Gensou no Grimgar\nFear, survival, instinct. Thrown into a foreign land with nothing but hazy memories and the knowledge of their name, they can feel only these three emotions resonating deep within their souls. A group of strangers is given no other choice than to accept the only paying job in this game-like world--the role of a soldier in the Reserve Army--and eliminate anything that threatens the peace in their new world, Grimgar. When all of the stronger candidates join together, those left behind must create a party together to survive: Manato, a charismatic leader and priest; Haruhiro, a nervous thief; Yume, a cheerful hunter; Shihoru, a shy mage; Moguzo, a kind warrior; and Ranta, a rowdy dark knight. Despite its resemblance to one, this is no game--there are no redos or respawns; it is kill or be killed. It is now up to this ragtag group of unlikely fighters to survive together in a world where life and death are separated only by a fine line. [Written by MAL Rewrite]\nStudio A-1 Pictures\nSource Light novel\nTheme Isekai\n7.66\n774K\nAdd to My List",
      "metadata": {
        "doc_index": 28,
        "header_level": 2,
        "header": "## Hai to Gensou no Grimgar",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Arifureta Shokugyou de Sekai Saikyou\nTV, 2019 Finished 13 eps, 23 min\nAction Adventure Fantasy\nArifureta Shokugyou de Sekai Saikyou\nThe ordinary life of 17-year-old otaku Hajime Nagumo is disrupted when he and his classmates are summoned to a fantasy world and tasked with saving mankind. While his classmates are gifted with impressive abilities useful in combat, Hajime is belittled for only gaining an inferior transmutation skill that lacks any real offensive power. During an expedition in the Great Orcus Labyrinth, Hajime is betrayed by one of his classmates, plummeting him to the bottom of an abyss. Though he survives the fall, Hajime is faced with menacing monsters and misfortunes that send him spiraling into a grim nightmare. Desperate to live and return home one day, he resolves to fight for his survival--only to meet an imprisoned vampire he names Yue, who is also seeking to escape the labyrinth. Taking an interest in him, Yue and a few others along the way accompany Hajime on his journey to find a way back home, while steadily transforming from commonplace to the world's strongest. [Written by MAL Rewrite]\nStudios asread. White Fox\nSource Light novel\nThemes Harem Isekai\n6.72\n773K\nAdd to My List",
      "metadata": {
        "doc_index": 29,
        "header_level": 2,
        "header": "## Arifureta Shokugyou de Sekai Saikyou",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kage no Jitsuryokusha ni Naritakute! - 2 TV, 2022 Finished 20 eps, 23 min\nAction Comedy Fantasy\nKage no Jitsuryokusha ni Naritakute!\nFor as long as he can remember, Minoru Kagenou has been fixated on becoming as strong as possible, which has led him to undertake all kinds of rigorous training.\nThis wish, however, does not stem from a desire to be recognized by others; rather, Minoru does everything he can to blend in with the crowd.\nSo, while pretending to be a completely average student during the day, he arms himself with a crowbar and ruthlessly thrashes local biker gangs at night.\nYet when Minoru finds himself in a truck accident, his ambitions seemingly come to a sudden end.\nIn his final moments, he laments his powerlessness--no matter how much he trained, there was nothing he could do to overcome his human limitations.\nBut instead of dying, Minoru reawakens as Cid, the second child of the noble Kagenou family, in another world--one where magic is commonplace.\nWith the power he so desired finally within his grasp, he dons the moniker \"Shadow\" and establishes Shadow Garden: a group whose sole purpose is to combat the enigmatic Cult of Diablos, an organization born from Cid's imagination.",
      "metadata": {
        "doc_index": 30,
        "header_level": 2,
        "header": "## Kage no Jitsuryokusha ni Naritakute! - 2 TV, 2022 Finished 20 eps, 23 min",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kage no Jitsuryokusha ni Naritakute! - 10 However, as Shadow Garden grows in both membership and influence, it becomes increasingly apparent that the Cult of Diablos is not as fictional as Cid had intended.\n[Written by MAL Rewrite]\nStudio Nexus\nSource Light novel\nThemes Isekai Reincarnation\n8.25\n772K\nAdd to My List",
      "metadata": {
        "doc_index": 31,
        "header_level": 2,
        "header": "## Kage no Jitsuryokusha ni Naritakute! - 10 However, as Shadow Garden grows in both membership and influence, it becomes increasingly apparent that the Cult of Diablos is not as fictional as Cid had intended.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Maou to Shoukan Shoujo no Dorei Majutsu\nTV, 2018 Finished 12 eps, 23 min\nAction Comedy Fantasy Romance Ecchi\nIsekai Maou to Shoukan Shoujo no Dorei Majutsu\nWhen it comes to the fantasy MMORPG Cross Reverie, none can match the power of the Demon King Diablo.\nPossessing the game's rarest artifacts and an unrivaled player level, he overpowers all foolish enough to confront him.\nBut despite his fearsome reputation, Diablo's true identity is Takuma Sakamoto, a shut-in gamer devoid of any social skills.\nDefeating hopeless challengers day by day, Takuma cares about nothing else but his virtual life--that is, until a summoning spell suddenly transports him to another world where he has Diablo's appearance!\nIn this new world resembling his favorite game, Takuma is greeted by the two girls who summoned him: Rem Galeu, a petite Pantherian adventurer, and Shera L. Greenwood, a busty Elf summoner.",
      "metadata": {
        "doc_index": 32,
        "header_level": 2,
        "header": "## Isekai Maou to Shoukan Shoujo no Dorei Majutsu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Maou to Shoukan Shoujo no Dorei Majutsu - 6 They perform an Enslavement Ritual in an attempt to subjugate him, but the spell backfires and causes them to become his slaves instead.\nWith the situation now becoming more awkward than ever, Takuma decides to accompany the girls in finding a way to unbind their contract while learning to adapt to his new existence as the menacing Demon King.\n[Written by MAL Rewrite]\nStudio Ajia-do\nSource Light novel\nThemes Harem Isekai\n6.82\n768K\nAdd to My List",
      "metadata": {
        "doc_index": 33,
        "header_level": 2,
        "header": "## Isekai Maou to Shoukan Shoujo no Dorei Majutsu - 6 They perform an Enslavement Ritual in an attempt to subjugate him, but the spell backfires and causes them to become his slaves instead.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei II: Isekai Ittara Honki Dasu\nTV, 2023 Finished 12 eps, 23 min\nAdventure Drama Fantasy Ecchi\nMushoku Tensei II: Isekai Ittara Honki Dasu\nAfter his relationship with Eris Boreas Greyrat reaches new heights, Rudeus Greyrat is ecstatic.\nUnfortunately, his joy is short-lived, as Eris suddenly abandons him to embark on her own journey.\nBelieving that Eris has lost all interest in him, a heartbroken and depressed Rudeus sets forth to the Northern Territories.\nWith his sole goal being to locate his mother on the vast continent, Rudeus wonders if persisting through daily life is worth the pain, falling into a robotic routine as he endlessly ruminates on his lost love.\nHowever, the dangers of the North soon prove that one cannot survive with a dulled mind.",
      "metadata": {
        "doc_index": 34,
        "header_level": 2,
        "header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei II: Isekai Ittara Honki Dasu - 6 While on a quest with the party Counter Arrow, with whom he recently became acquainted, Rudeus has a brush with death--an experience that forces him to finally snap out of his despair.\nWith his newfound teammates, Rudeus rediscovers the pleasure of daily adventuring and moves forward with his original goal of living his second lease on life to the fullest.\n[Written by MAL Rewrite]\nStudio Studio Bind\nSource Light novel\nThemes Isekai Reincarnation\n8.22\n673K\nAdd to My List",
      "metadata": {
        "doc_index": 35,
        "header_level": 2,
        "header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu - 6 While on a quest with the party Counter Arrow, with whom he recently became acquainted, Rudeus has a brush with death--an experience that forces him to finally snap out of his despair.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Shinchou Yuusha: Kono Yuusha ga Ore Tueee Kuse ni Shinchou Sugiru\nTV, 2019 Finished 12 eps, 23 min\nAction Adventure Comedy Fantasy\nShinchou Yuusha: Kono Yuusha ga Ore Tueee Kuse ni Shinchou Sugiru\nThere is a popular saying: \"you can never be too careful.\" It is very important to prepare for every situation you may face, even if it seems like an unnecessary waste of time. Also, in games like RPGs, it is good to exceed the level of your enemies to achieve total victory. These words describe Seiya Ryuuguuin a little too perfectly. After being summoned by the goddess Ristarte to save the world of Gaeabrande from destruction, the hero prepares himself for his noble journey. While this might be normal, he spends a very long time training himself, despite having overpowered stats. He fights weak enemies using his strongest skills and buys excessive amounts of supplies and potions--all to stay safe. While his attitude may be a bit annoying, it might just be the saving grace of Gaeabrande, especially considering that it is a world where the forces of evil dominate each and every expectation. [Written by MAL Rewrite]\nStudio White Fox\nSource Light novel\nThemes Isekai Parody\n7.47\n664K\nAdd to My List",
      "metadata": {
        "doc_index": 36,
        "header_level": 2,
        "header": "## Shinchou Yuusha: Kono Yuusha ga Ore Tueee Kuse ni Shinchou Sugiru",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kenja no Mago - 1 ## Kenja no Mago\nTV, 2019 Finished 12 eps, 23 min\nAction Comedy Fantasy Romance\nKenja no Mago\nIn the kingdom of Earlshide, Merlin Wolford was once regarded as a national hero, hailed for both his power and achievements.\nPreferring a quiet life however, he secludes himself deep in the rural woods, dedicating his time to raising an orphan that he saved.\nThis orphan is Shin, a normal salaryman in modern-day Japan who was reincarnated into Merlin's world while still retaining his past memories.\nAs the years pass, Shin displays unparalleled talent in both magic casting and martial arts, much to Merlin's constant amazement.\nOn his 15th birthday, however, it becomes apparent that Shin only developed his combat skills and nothing else, leaving him with blatant social awkwardness, a lack of common sense, and a middling sense of responsibility.\nAs a result, Shin enrolls in the kingdom's Magic Academy to hone his skills and mature among other teenagers.\nHowever, living a normal life is impossible, as he is established as a local celebrity almost as soon as he arrives.\nAs Shin Wolford adjusts to his high school life in the capital, he makes new friends, learns about the world, and fights off the various forces of evil surrounding him and his city.\n[Written by MAL Rewrite]\nStudio SILVER LINK.",
      "metadata": {
        "doc_index": 37,
        "header_level": 2,
        "header": "## Kenja no Mago - 1 ## Kenja no Mago",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kenja no Mago - 10 Source Light novel\nThemes Isekai Reincarnation\n6.62\n631K\nAdd to My List",
      "metadata": {
        "doc_index": 38,
        "header_level": 2,
        "header": "## Kenja no Mago - 10 Source Light novel",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mondaiji-tachi ga Isekai kara Kuru Sou desu yo?\nTV, 2013 Finished 10 eps, 23 min\nAction Comedy Fantasy\nMondaiji-tachi ga Isekai kara Kuru Sou desu yo?\nIzayoi Sakamaki, Asuka Kudou, and You Kasukabe are extraordinary teenagers who are blessed with psychic powers but completely fed up with their disproportionately mundane lives--until, unexpectedly, each of them receives a strange envelope containing an invitation to a mysterious place known as Little Garden. Inexplicably dropped into a vast new world, the trio is greeted by Kurousagi, who explains that they have been given a once-in-a-lifetime chance to participate in special high-stakes games using their abilities. In order to take part, however, they must first join a community. Learning that Kurousagi's community \"No Names\" has lost its official status and bountiful land due to their defeat at the hands of a demon lord, the group sets off to help reclaim their new home's dignity, eager to protect its residents and explore the excitement that Little Garden has to offer. [Written by MAL Rewrite]\nStudio Diomedea\nSource Light novel\nThemes Isekai Mythology\n7.41\n605K\nAdd to My List",
      "metadata": {
        "doc_index": 39,
        "header_level": 2,
        "header": "## Mondaiji-tachi ga Isekai kara Kuru Sou desu yo?",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai wa Smartphone to Tomo ni.\nTV, 2017 Finished 12 eps, 24 min\nAdventure Comedy Fantasy Romance\nIsekai wa Smartphone to Tomo ni.\nIn a thoughtless blunder, God accidentally strikes down Touya Mochizuki with a stray bolt of lightning! As an apology, God offers him one wish and the chance to live again in a magical fantasy world. Touya happily accepts the offer and, for his one wish, asks only to keep his smartphone with him as he begins his journey into this mysterious world. Starting over in this new world, Touya finds it is filled with magic--which he has an affinity for--and cute girls vying for his attention. These girls--the twins Linze and Elze Silhoueska, Yumina Urnea Belfast, Leen, and Yae Kokonoe--provide Touya with no end of romantic frustrations, but also companionship as he discovers the secrets of this new world. [Written by MAL Rewrite]\nStudio Production Reed\nSource Light novel\nThemes Harem Isekai\n6.11\n603K\nAdd to My List",
      "metadata": {
        "doc_index": 40,
        "header_level": 2,
        "header": "## Isekai wa Smartphone to Tomo ni.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Drifters - 1 ## Drifters\nTV, 2016 Finished 12 eps, 24 min\nAction Adventure Comedy Fantasy\nDrifters\nAt the Battle of Sekigahara in 1600, Toyohisa Shimazu is the rearguard for his retreating troops, and is critically wounded when he suddenly finds himself in a modern, gleaming white hallway.\nFaced with only a stoic man named Murasaki and hundreds of doors on both sides, Toyohisa is pulled into the nearest door and into a world completely unlike his own.\nThe strange land is populated by all manner of fantastical creatures, as well as warriors from different eras of Toyohisa's world who were thought to be dead.\nQuickly befriending the infamous warlord Nobunaga Oda and the ancient archer Yoichi Suketaka Nasu, Toyohisa learns of the political unrest tearing through the continent.\nFurthermore, they have been summoned as \"Drifters\" to fight against the \"Ends,\" people who are responsible for the creation of the Orte Empire and are trying to annihilate the Drifters.\nAs the Ends grow more powerful, so does the Empire's persecution of elves and other demihumans.\nIt is up to Toyohisa and his group of unconventional heroes to battle in a brand-new world war to help the Empire's subjects, while challenging the Ends protecting the land to claim it for themselves.",
      "metadata": {
        "doc_index": 41,
        "header_level": 2,
        "header": "## Drifters - 1 ## Drifters",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Drifters - 8 [Written by MAL Rewrite]\nStudio Hoods Entertainment\nSource Manga\nThemes Adult Cast Gore Historical Isekai Military Samurai\nDemographic Seinen\n7.88\n598K\nAdd to My List",
      "metadata": {
        "doc_index": 42,
        "header_level": 2,
        "header": "## Drifters - 8 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Sekai Saikou no Ansatsusha, Isekai Kizoku ni Tensei suru\nTV, 2021 Finished 12 eps, 23 min\nAction Drama Fantasy Mystery Romance\nSekai Saikou no Ansatsusha, Isekai Kizoku ni Tensei suru\nThe world's greatest assassin had sworn lifelong allegiance to the organization that raised him.\nHowever, despite his loyalty, that very same organization takes action to silence him, ultimately leading to his demise.\nDrowning in frustration and regrets he can no longer suppress, he finds himself in an audience with a goddess attracted by his exceptional skills.\nThe goddess offers him reincarnation into a magnificent world of swords and magic so he can perform a crucial mission: prevent that world's destruction by slaying its hero.\nAccepting the goddess' request, he is reborn as Lugh Tuatha De, the son of a noble family of assassins serving the Alvan Kingdom.\nUnder the guidance of his father, Lugh learns new assassination techniques that significantly differ from the cold-blooded and unsympathetic killing style of his previous life.\nFurthermore, his other talents bloom, allowing him to meet new allies and acquaintances.",
      "metadata": {
        "doc_index": 43,
        "header_level": 2,
        "header": "## Sekai Saikou no Ansatsusha, Isekai Kizoku ni Tensei suru",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Sekai Saikou no Ansatsusha, Isekai Kizoku ni Tensei suru - 8 Even so, Lugh knows that his efforts are far from adequate, because a monumental adversary such as the hero can only be defeated with perfection.\n[Written by MAL Rewrite]\nStudios SILVER LINK.\nStudio Palette\nSource Light novel\nThemes Isekai Reincarnation\n7.33\n595K\nAdd to My List",
      "metadata": {
        "doc_index": 44,
        "header_level": 2,
        "header": "## Sekai Saikou no Ansatsusha, Isekai Kizoku ni Tensei suru - 8 Even so, Lugh knows that his efforts are far from adequate, because a monumental adversary such as the hero can only be defeated with perfection.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Overlord IV\nTV, 2022 Finished 13 eps, 23 min\nAction Adventure Fantasy\nOverlord IV\nE-Rantel, the capital city of the newly established Sorcerer Kingdom, suffers from a dire shortage of goods. Once a prosperous city known for its trade, it now faces a crisis due to its caution--or even fear--of its king, Ainz Ooal Gown. To make amends, Ainz sends Albedo to the city as a diplomatic envoy. Meanwhile, the cardinals of the Slane Theocracy discuss how to retaliate against Ainz after his attack crippled the Re-Estize Kingdom's army, plotting for the Baharuth Empire to take over the Sorcerer Kingdom. However, when Emperor Jircniv Rune Farlord El Nix arranges a meeting with the Theocracy's messengers at a colosseum, he is confronted by none other than Ainz himself. With their secret gathering now out in the open, the emperor and his guests learn that Ainz has challenged the Warrior King, the empire's greatest fighter, to a duel. With Ainz's motivations beyond his comprehension, Jircniv can do nothing but watch as humanity's future changes before his very eyes. [Written by MAL Rewrite]\nStudio Madhouse\nSource Light novel\nTheme Isekai\n8.07\n591K\nAdd to My List",
      "metadata": {
        "doc_index": 45,
        "header_level": 2,
        "header": "## Overlord IV",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Gate: Jieitai Kanochi nite, Kaku Tatakaeri Part 2\nTV, 2016 Finished 12 eps, 23 min\nAction Adventure Fantasy\nGate: Jieitai Kanochi nite, Kaku Tatakaeri Part 2\nSeveral months have passed since the infamous Ginza Incident, with tensions between the Empire and JSDF escalating in the vast and mysterious \"Special Region\" over peace negotiations. The greed and curiosity of the global powers have also begun to grow, as reports about the technological limitations of the magical realm's archaic civilizations come to light. Meanwhile, Lieutenant Youji Itami and his merry band of female admirers struggle to navigate the complex political intrigue that plagues the Empire's court. Despite her best efforts, Princess Pina Co Lada faces difficulties attempting to convince her father that the JSDF has no intention of conquering their kingdom. Pressured from both sides of the Gate, Itami must consider even more drastic measures to fulfill his mission. [Written by MAL Rewrite]\nStudio A-1 Pictures\nSource Light novel\nThemes Isekai Military\n7.71\n582K\nAdd to My List",
      "metadata": {
        "doc_index": 46,
        "header_level": 2,
        "header": "## Gate: Jieitai Kanochi nite, Kaku Tatakaeri Part 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Death March kara Hajimaru Isekai Kyousoukyoku\nTV, 2018 Finished 12 eps, 23 min\nAdventure Fantasy\nDeath March kara Hajimaru Isekai Kyousoukyoku\nIchirou Suzuki, a programmer nearing his thirties, is drowning in work. Worn out, he eventually has a chance to catch up on sleep, only to wake up and discover himself in a fantasy RPG world, which is mashed together from the games he was debugging in reality. In this new place, he realizes that not only has his appearance changed to a younger version of himself, but his name has also changed to Satou, a nickname he used while running beta tests on games. However, before Satou can fully grasp his situation, an army of lizardmen launch an assault on him. Forced to cast a powerful spell in retaliation, Satou wipes them out completely and his level is boosted to 310, effectively maximizing his stats. Now, as a high-leveled adventurer armed with a plethora of skills and no way to return to reality, Satou sets out to explore this magical new world. [Written by MAL Rewrite]\nStudios Connect SILVER LINK.\nSource Light novel\nThemes Harem Isekai\n6.43\n538K\nAdd to My List",
      "metadata": {
        "doc_index": 47,
        "header_level": 2,
        "header": "## Death March kara Hajimaru Isekai Kyousoukyoku",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Zero no Tsukaima: Futatsuki no Kishi\nTV, 2007 Finished 12 eps, 23 min\nAction Adventure Comedy Fantasy Romance Ecchi\nZero no Tsukaima: Futatsuki no Kishi\nRevered as heroes for their role in defending Tristain, Louise Francoise and her familiar Saito Hiraga face heavy pressure to continue protecting the Kingdom. With an uneasy peace now established within Albion, the newly crowned Queen Henrietta must deal with a political struggle brewing on the horizon. To make matters worse, a new villain has begun plotting in the shadows against the Crown. With the continuing threats that face the Kingdom, Louise and Saito are compelled to work together once more. No longer \"Louise the Zero,\" the young mage's newfound aptitude for Void magic gives her enough power to wipe out an entire village; however, wielding these abilities comes with its share of challenges. As more conflicts arise, the idea of placing honor above oneself is put into question--regardless of their answer, their only choice is to see it through until the end. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nThemes Harem Isekai School\n7.39\n519K\nAdd to My List",
      "metadata": {
        "doc_index": 48,
        "header_level": 2,
        "header": "## Zero no Tsukaima: Futatsuki no Kishi",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tsuki ga Michibiku Isekai Douchuu\nTV, 2021 Finished 12 eps, 23 min\nAction Adventure Comedy Fantasy\nTsuki ga Michibiku Isekai Douchuu\nAs part of a mysterious contract agreed upon by a goddess and his parents years ago, Makoto Misumi finds himself sent to another world to meet the goddess and become the hero. However, the deity deems Makoto to be \"hideous,\" refusing to even lay eyes upon him and revokes his heroic title. Disdainfully giving him the ability to understand all languages except the human language as compensation, the goddess drives Makoto off to the farthest edges of the wasteland, far from human civilization. Due to the disparity between Earth and this new world, Makoto's inherent physical and magical capabilities awaken, making him extremely powerful. He meets various demihumans and mythical beings who all end up being captivated with his characteristics and join Makoto in building a new community where all of them can peacefully coexist. Nevertheless, despite this success, Makoto still yearns to meet fellow humans. In a world where the goddess herself has barred him from interacting with his kind, it is up to Makoto and his companions to fulfill his desire--and perhaps reform society along the way. [Written by MAL Rewrite]\nStudio C2C\nSource Light novel\nTheme Isekai\n7.71\n511K\nAdd to My List",
      "metadata": {
        "doc_index": 49,
        "header_level": 2,
        "header": "## Tsuki ga Michibiku Isekai Douchuu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kono Subarashii Sekai ni Shukufuku wo! 3\nTV, 2024 Finished 11 eps, 23 min\nAdventure Comedy Fantasy\nKono Subarashii Sekai ni Shukufuku wo! 3\nKazuma Satou, former NEET and current reincarnated adventurer, finally returns home after the incident at the Crimson Demon village. He is joined by his ever-reliable companions: self-absorbed goddess Aqua, one-trick pony arch-wizard Megumin, and masochistic crusader Lalatina Ford \"Darkness\" Dustiness. Following their recent exploits, the party is one step closer to vanquishing the Demon King and his armies--a terrifying task that Kazuma is eager to ignore for as long as possible. Things, however, are not going as smoothly as the group would like; they are constantly racking up debt, getting sidetracked during missions, and falling into traps due to their recklessness and eccentricities. As the party struggles with their perennial issues, they receive an invitation from a princess interested in hearing tales of the group's \"heroic\" deeds. Darkness' pleas to refuse the invitation only fire the others up to accept it, marking the start of yet another uncanny adventure with unforeseen consequences. [Written by MAL Rewrite]\nStudio Drive\nSource Light novel\nThemes Isekai Parody\n8.35\n491K\nAdd to My List",
      "metadata": {
        "doc_index": 50,
        "header_level": 2,
        "header": "## Kono Subarashii Sekai ni Shukufuku wo! 3",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei II: Isekai Ittara Honki Dasu Part 2 - 1 ## Mushoku Tensei II: Isekai Ittara Honki Dasu Part 2\nTV, 2024 Finished 12 eps, 23 min\nAdventure Drama Fantasy Ecchi\nMushoku Tensei II: Isekai Ittara Honki Dasu Part 2\nFollowing the faceless god Hitogami's advice seems to have worked wonders for Rudeus Greyrat.\nAfter enrolling into the University of Magic as he was told, Rudeus reunites with his childhood friend Sylphiette, who put a valiant effort into curing his condition.\nThe two grow ever closer together and decide to host a wedding party, inviting the friends they have made over the years to announce and formalize their relationship.\nFor all his recent blessings, however, Rudeus' troubles are far from over.\nThe research he is helping Shizuka Nanahoshi conduct hits a bottleneck, sending her into a deep slump much like he experienced in his previous life.\nFurthermore, a letter from his father, Paul, brings complications to Rudeus' relationships, and Sylphiette still knows next to nothing about his real background.\nIn the face of these issues, Rudeus will have to apply the lessons he has learned in this new world to navigate through the challenges that come with living a life to its fullest.",
      "metadata": {
        "doc_index": 51,
        "header_level": 2,
        "header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu Part 2 - 1 ## Mushoku Tensei II: Isekai Ittara Honki Dasu Part 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei II: Isekai Ittara Honki Dasu Part 2 - 8 [Written by MAL Rewrite]\nStudio Studio Bind\nSource Light novel\nThemes Isekai Reincarnation\n8.42\n488K\nAdd to My List",
      "metadata": {
        "doc_index": 52,
        "header_level": 2,
        "header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu Part 2 - 8 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Otome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta...\nTV, 2020 Finished 12 eps, 24 min\nComedy Fantasy Romance\nOtome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta...\nMost people would prefer being the protagonist of a world full of adventure, be it in a game or in another world.\nBut, unfortunately, a certain girl is not so lucky.\nRegaining the memories of her past life, she realizes that she was reborn in the world of Fortune Lover--one of the games she used to play.\nUnfortunately, the character she was reincarnated into--Catarina Claes--is the game's main antagonist, who faces utter doom in every ending.\nUsing her extensive knowledge of the game, she takes it upon herself to escape from the chains of this accursed destiny.\nHowever, this will not be an easy feat, especially since she needs to be cautious as to not set off death flags that may speed up the impending doom she is trying to avoid.\nEven so, to make a change that will affect the lives of everyone around her, she strives--not as the heroine--but as the villainess.",
      "metadata": {
        "doc_index": 53,
        "header_level": 2,
        "header": "## Otome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta...",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Otome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta... - 9 [Written by MAL Rewrite]\nStudio SILVER LINK.\nSource Light novel\nThemes Isekai Reverse Harem School Villainess\nDemographic Shoujo\n7.45\n487K\nAdd to My List",
      "metadata": {
        "doc_index": 54,
        "header_level": 2,
        "header": "## Otome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta... - 9 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tate no Yuusha no Nariagari Season 3\nTV, 2023 Finished 12 eps, 23 min\nAction Adventure Drama Fantasy\nTate no Yuusha no Nariagari Season 3\nThough he has successfully repelled the latest Wave of Catastrophe, Naofumi Iwatani--the Shield Hero--has no time to rest. Naofumi is spurred back into action when Queen Mirelia Q Melromarc tells him that the three other Cardinal Heroes have disappeared without a trace, and she tasks him with finding them. With no clues regarding their whereabouts, Naofumi tackles a more pressing issue: the worsening slave trade of demi-humans. Determined to right this injustice, he and his friends find their way to Zeltoble, the country of mercenaries, where the illegal sale of demi-humans has become a lucrative business. To gather money to free the slaves, Naofumi and his comrades disguise themselves and take part in underground coliseum brawls, purposely throwing matches to manipulate the odds and eventually secure an enormous payout. However, with the threat of another Wave of Catastrophe looming on the horizon, the Shield Hero must stick to his mission of finding the missing heroes if he wants to protect those he loves. [Written by MAL Rewrite]\nStudio Kinema Citrus\nSource Light novel\nTheme Isekai\n7.10\n481K\nAdd to My List",
      "metadata": {
        "doc_index": 55,
        "header_level": 2,
        "header": "## Tate no Yuusha no Nariagari Season 3",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kumo desu ga, Nani ka?\nTV, 2021 Finished 24 eps, 23 min\nAction Adventure Comedy Fantasy\nKumo desu ga, Nani ka?\nThe day is as normal as it can be in high school as the students peacefully go about their everyday activities until an unprecedented catastrophe strikes the school, killing every person in its wake. Guided by what seems to be a miracle, a handful of students are fortunate enough to be reincarnated into another world as nobles, princes, and other kinds of people with prestigious backgrounds. One girl, however, is not so lucky. Being reborn as a spider of the weakest kind, she immediately experiences the hardships of her dire situation. Even so, she must press on to survive the numerous threats that endanger her life. Discovering that her new world has a system like that of an RPG, she tries her best to hunt prey and defeat monsters to level up and evolve. As she gradually grows stronger, she hopes one day her efforts will be rewarded, and that she will be granted a better life. [Written by MAL Rewrite]\nStudio Millepensee\nSource Light novel\nThemes Isekai Reincarnation\n7.45\n480K\nAdd to My List",
      "metadata": {
        "doc_index": 56,
        "header_level": 2,
        "header": "## Kumo desu ga, Nani ka?",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kage no Jitsuryokusha ni Naritakute! 2nd Season - 2 2nd Season\nTV, 2023 Finished 12 eps, 23 min\nAction Comedy Fantasy\nKage no Jitsuryokusha ni Naritakute!\n2nd Season\nEnticed by its rumored wealth, Cid Kagenou happily tags along with his sister, Claire, on a trip to the infamous Lawless City.\nThe region is ruled by three monarchs: Yukime, the Spirit Fox; Juggernaut, the Tyrant; and Elisabeth, a dormant progenitor vampire known as the Blood Queen.\nHunting Elisabeth down serves as the perfect opportunity for Claire to prove her true mettle.\nOn the other hand, Cid has different objectives--sneaking away from Claire's sight, collecting as much loot as possible, and making Shadow's glorious entrance at the perfect moment.\nAs Elisabeth's awakening draws near, her subordinate Crimson enacts a treacherous plot, sending the town into a frenzy.\nSearching for her now-missing brother, Claire finds an unexpected ally in Mary, a vampire hunter, and the pair hurry to the Crimson Tower--the home of the Blood Queen.\nMeanwhile, Beta and a small team of Shadow Garden recruits also arrive at the Lawless City.\nAs the key players converge on the Crimson Tower, the stage is set for a grand confrontation under the crimson moon.",
      "metadata": {
        "doc_index": 57,
        "header_level": 2,
        "header": "## Kage no Jitsuryokusha ni Naritakute! 2nd Season - 2 2nd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kage no Jitsuryokusha ni Naritakute! 2nd Season - 11 [Written by MAL Rewrite]\nStudio Nexus\nSource Light novel\nThemes Isekai Reincarnation\n8.30\n463K\nAdd to My List",
      "metadata": {
        "doc_index": 58,
        "header_level": 2,
        "header": "## Kage no Jitsuryokusha ni Naritakute! 2nd Season - 11 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Zero no Tsukaima: Princesses no Rondo\nTV, 2008 Finished 12 eps, 24 min\nAction Adventure Comedy Fantasy Romance Ecchi\nZero no Tsukaima: Princesses no Rondo\nFollowing his brave sacrifice in the war against Albion, Saito Hiraga is knighted and treated as an aristocrat, something that proves difficult for Louise Francoise Le Blanc de La Valliere. With their relationship no longer defined as the mighty Void mage and clueless familiar, she wonders what exactly this means for them. While venturing to a castle, Louise is ambushed by a powerful mage named Sheffield. Battling alone, the young mage nearly faces defeat until Saito makes his appearance. The mystical and unknown nature of Void magic seems to be at work in the battle, and Louise begins to believe in the possibility of another Void user. Moreover, she realizes that Saito's magical rune is fading, and so a new adventure begins as they search for the elf who revived Saito in the past. The relationship between former master and servant faces a new challenge as they work to restore the runes and redefine the bond which holds them together. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nThemes Harem Isekai School\n7.31\n459K\nAdd to My List",
      "metadata": {
        "doc_index": 59,
        "header_level": 2,
        "header": "## Zero no Tsukaima: Princesses no Rondo",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Maou to Shoukan Shoujo no Dorei Majutsu O\nTV, 2021 Finished 10 eps, 24 min\nAction Comedy Fantasy Romance Ecchi\nIsekai Maou to Shoukan Shoujo no Dorei Majutsu O\nThe Demon King Diablo is back as... God? A fateful encounter with the High Priest Lumachina Weselia finds Diablo and his party accompanying this mysterious stranger on a journey to cleanse the Church of its corruption. Believed to be God by Lumachina, Diablo eventually decides to protect her on her initial quest to find the head paladin, the virtuous Batutta. Diablo, Rem, Shera and Lumachina are joined by the grasswalker, Horn and the Magmatic Maid, Rose. Will Diablo fulfil Lumachina's wish? And can the Demon Lord from Another World truly play the role of God?\nStudios Okuruto Noboru Tezuka Productions\nSource Light novel\nThemes Harem Isekai\n6.69\n445K\nAdd to My List",
      "metadata": {
        "doc_index": 60,
        "header_level": 2,
        "header": "## Isekai Maou to Shoukan Shoujo no Dorei Majutsu O",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Bakemono no Ko\nMovie, 2015 Finished 1 ep, 119 min\nFantasy\nBakemono no Ko\nTwo souls, living very different lives, wander alone and isolated in their respective worlds.",
      "metadata": {
        "doc_index": 61,
        "header_level": 2,
        "header": "## Bakemono no Ko",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Bakemono no Ko - 2 For nine-year-old Ren, the last person who treated him with any form of kindness has been killed, and he is shunned by what is left of his family.\nWith no parents, no real family, and no place to go, Ren escapes into the confusing streets and alleyways of Shibuya.\nThrough the twists and turns of the alleys, Ren stumbles into the intimidating Kumatetsu, who leads him to the beast realm of Shibuten.\nFor Kumatetsu, the boy represents a chance for him to become a candidate to replace the lord of the realm once he retires.\nWhile nearly unmatched in combat, Kumatetsu's chilly persona leaves him with no disciples to teach and no way to prove he is worthy of becoming the lord's successor.\nWhile the two share different goals, they agree to help each other in order to reach them.\nKumatetsu searches for recognition; Ren, now known as Kyuuta, searches for the home he never had.\nAs the years pass by, it starts to become apparent that the two are helping each other in more ways than they had originally thought.\nPerhaps there has always been less of a difference between them, a boy and a beast, than either of the two ever realized.\n[Written by MAL Rewrite]\nStudio Studio Chizu\nSource Original\nThemes Anthropomorphic Isekai\n8.23\n442K\nAdd to My List",
      "metadata": {
        "doc_index": 62,
        "header_level": 2,
        "header": "## Bakemono no Ko - 2 For nine-year-old Ren, the last person who treated him with any form of kindness has been killed, and he is shunned by what is left of his family.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Zero no Tsukaima F\nTV, 2012 Finished 12 eps, 24 min\nAction Adventure Comedy Fantasy Romance Ecchi\nZero no Tsukaima F\nSaito Hiraga and Louise Francoise Le Blanc de La Valliere go on the offensive after the events of Zero no Tsukaima: Princesses no Rondo. Together, they face off against King Joseph in the Holy City of Romalia with the help of two others who control the power of the \"void.\" But in the midst of the many conflicts ahead of them, an ancient evil begins to stir in the shadows. Will their close bonds blossom into something more or will they be shattered through the ever increasing difficulty of the tasks that they must undertake? Zero no Tsukaima F follows the story of Louise and Saito as they face their final challenges together. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nThemes Harem Isekai School\n7.42\n436K\nAdd to My List",
      "metadata": {
        "doc_index": 63,
        "header_level": 2,
        "header": "## Zero no Tsukaima F",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Arifureta Shokugyou de Sekai Saikyou 2nd Season\nTV, 2022 Finished 12 eps, 23 min\nAction Adventure Fantasy\nArifureta Shokugyou de Sekai Saikyou 2nd Season\nAfter rescuing his former classmates from the perils of a labyrinth--a mythical place that grants a divine magic to whosoever triumphs over its trials--Nagumo Hajime emerges victorious, while the new heroes of the fantasy world Tortus must face their first major failure. Together with his traveling companions and the new team member Kaori Shirasaki, Nagumo resumes his journey to conquer all labyrinths and eventually return to his original world. Meanwhile, the heroes from Earth try learning from their mistakes and prepare for the demon army's invasion. As the final confrontation looms closer, new and old enemies start setting their evil plans in motion. Once more, Nagumo must prove that he can prevail against the most formidable opponents, all while protecting the ones he holds closest to his heart. [Written by MAL Rewrite]\nStudios asread. studio MOTHER\nSource Light novel\nThemes Harem Isekai\n7.15\n433K\nAdd to My List",
      "metadata": {
        "doc_index": 64,
        "header_level": 2,
        "header": "## Arifureta Shokugyou de Sekai Saikyou 2nd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Genjitsu Shugi Yuusha no Oukoku Saikenki\nTV, 2021 Finished 13 eps, 24 min\nAction Fantasy Romance\nGenjitsu Shugi Yuusha no Oukoku Saikenki\nAfter the death of his grandfather, 19-year-old Kazuya Souma--an aspiring civil servant--is left all alone with no one to call family. Out of the blue, he is transported to the Elfrieden Kingdom, a small ailing country in another world, to be a \"hero.\" An ongoing war with the demon army has put the entire world in peril, and Kazuya was summoned to aid in the conflict as an offering from Elfrieden to its allies. Dissatisfied with being used as tribute, Kazuya decides to help the kingdom revamp its declining economy--not by way of adventuring or war, but through administrative reform. Abruptly declared the King of Elfrieden and betrothed to the princess, the \"Realist Hero\" Kazuya sets out to assemble a group of talented citizens who will assist him in his bureaucratic battles to get the kingdom back on its feet. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nThemes Harem Isekai Military\n7.25\n431K\nAdd to My List",
      "metadata": {
        "doc_index": 65,
        "header_level": 2,
        "header": "## Genjitsu Shugi Yuusha no Oukoku Saikenki",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kono Subarashii Sekai ni Shukufuku wo!: Kono Subarashii Choker ni Shukufuku wo!\nOVA, 2016 Finished 1 ep, 23 min\nComedy Fantasy\nKono Subarashii Sekai ni Shukufuku wo!: Kono Subarashii Choker ni Shukufuku wo!\nWhile exploring Wiz's magic shop with his party, Kazuma Satou finds a magical wish-granting choker and decides to try it on. Only then does Wiz tell him that the choker strangles its wearer to death in four days unless their desires are fulfilled. This wouldn't be a problem if Kazuma knew what his wish was. Fearing for Kazuma's life, Aqua, Megumin, and Lalatina Ford \"Darkness\" Dustiness all agree to do his bidding in order to satisfy his desires and hopefully grant his wish, no matter what he asks for. [Written by MAL Rewrite]\nStudio Studio Deen\nSource Light novel\nThemes Isekai Parody\n7.83\n429K\nAdd to My List",
      "metadata": {
        "doc_index": 66,
        "header_level": 2,
        "header": "## Kono Subarashii Sekai ni Shukufuku wo!: Kono Subarashii Choker ni Shukufuku wo!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Seirei Gensouki\nTV, 2021 Finished 12 eps, 23 min\nAction Adventure Fantasy Romance\nSeirei Gensouki\nWhen 20-year-old college student Haruto Amakawa dies in a traffic accident, he does not expect to wake up in an unfamiliar world in the body of a young boy named Rio. As their memories and personas fuse, Rio realizes that he now also possesses magical powers. He is relieved to find that his burning passion for revenge against his mother's murderers has not subsided, despite his newly changed identity. Not soon after, Rio comes across the kidnapped princess of the Bertram Kingdom and saves her without hesitation. To express his gratitude, the king grants him the opportunity to enroll in the Bertram Royal Academy. Believing this to be a new chapter in his life, he is excited to study at this prestigious academy, but life here proves to be difficult for him, a slum-dweller surrounded by the majestic children of nobles. [Written by MAL Rewrite]\nStudio TMS Entertainment\nSource Light novel\nThemes Harem Isekai Reincarnation\n7.07\n424K\nAdd to My List",
      "metadata": {
        "doc_index": 67,
        "header_level": 2,
        "header": "## Seirei Gensouki",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Slime Taoshite 300-nen, Shiranai Uchi ni Level Max ni Nattemashita - 1 ## Slime Taoshite 300-nen, Shiranai Uchi ni Level Max ni Nattemashita\nTV, 2021 Finished 12 eps, 23 min\nComedy Fantasy\nSlime Taoshite 300-nen, Shiranai Uchi ni Level Max ni Nattemashita\nIn role-playing games, slimes are usually the easiest monster to kill, and because of that, they yield few experience points.\nBut what would happen if you live long enough to keep defeating them for 300 years?\nAfter many years of being a corporate slave, Azusa Aizawa abruptly passes away due to severe exhaustion.\nSeemingly headed for the afterlife, she meets a goddess who bestows her with immortality alongside a peaceful life in another world.\nThere, Azusa enjoys her days tending to her farm, protecting the nearby village, and killing about 25 slimes per day--a routine that continues for at least three centuries.\nHowever, this rather monotonous cycle begins to change when Azusa suddenly finds out that she has reached level 99--the maximum possible level--from slimes alone.\nDespite desperately trying to hide this fact in fear of ending her slow life, rumors of her strength spread nevertheless.\nSoon enough, various people throughout the continent, like the dragon Laika and the elf Halkara, start to appear at her doorstep--some seeking a battle, others asking for her assistance.",
      "metadata": {
        "doc_index": 68,
        "header_level": 2,
        "header": "## Slime Taoshite 300-nen, Shiranai Uchi ni Level Max ni Nattemashita - 1 ## Slime Taoshite 300-nen, Shiranai Uchi ni Level Max ni Nattemashita",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Slime Taoshite 300-nen, Shiranai Uchi ni Level Max ni Nattemashita - 9 Meeting friends and acquaintances who soon become family, Azusa finds she can live a life far better with others than when she was alone.\n[Written by MAL Rewrite]\nStudio Revoroot\nSource Light novel\nThemes CGDCT Isekai\n6.91\n421K\nAdd to My List",
      "metadata": {
        "doc_index": 69,
        "header_level": 2,
        "header": "## Slime Taoshite 300-nen, Shiranai Uchi ni Level Max ni Nattemashita - 9 Meeting friends and acquaintances who soon become family, Azusa finds she can live a life far better with others than when she was alone.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Slime Datta Ken 3rd Season\nTV, 2024 Finished 24 eps, 24 min\nAction Comedy Fantasy\nTensei shitara Slime Datta Ken 3rd Season\nRimuru Tempest is victorious following his climactic showdown with Demon Lord Clayman. With Diablo's aid, the war with the Falmuth Kingdom ends decisively in Rimuru's favor. Fueled by increased migration and the integration of Jura Forest, the nation of Tempest undergoes rapid growth. Rimuru's victory shifts the balance of power, giving rise to a renewed period of peace--but whether that peace will last is another matter. Yuuki Kagurazaka and Kazalim are conspiring with the Harlequin Alliance to bring about Rimuru's downfall. Furthermore, the Western Holy Church continues its intolerant crusade against Rimuru and his non-human subordinates. Both allies and enemies engage in a battle of wits, carefully advancing their agendas without shattering the delicate status quo. But once the first domino inevitably falls, the race to supremacy begins. [Written by MAL Rewrite]\nStudio 8bit\nSource Manga\nThemes Isekai Reincarnation\nDemographic Shounen\n7.69\n416K\nAdd to My List",
      "metadata": {
        "doc_index": 70,
        "header_level": 2,
        "header": "## Tensei shitara Slime Datta Ken 3rd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Digimon Adventure\nTV, 1999 Finished 54 eps, 24 min\nAction Adventure Comedy Fantasy\nDigimon Adventure\nWhen a group of seven children go to summer camp, the last thing that they expect is snow falling in July. In the confusion that follows this phenomenon, they each receive an odd device that transports them to another world. As soon as they wake up in this new world, they encounter strange creatures who call themselves \"Digimon.\" The Digimon tell them that they've landed in the \"Digital World,\" far from home. With only the Digimon and the \"Digivices\" as protection, the seven children set off to find their way home and learn the reason why they were brought here. Led by the impulsive Taichi Yagami and his hungry Digimon partner Agumon, this group will have to fight unknown evils as they discover more about this outlandish Digital World. [Written by MAL Rewrite]\nStudio Toei Animation\nSource Other\nTheme Isekai\nDemographic Kids\n7.78\n415K\nAdd to My List",
      "metadata": {
        "doc_index": 71,
        "header_level": 2,
        "header": "## Digimon Adventure",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Sentouin, Haken shimasu!\nTV, 2021 Finished 12 eps, 24 min\nAction Comedy Fantasy\nSentouin, Haken shimasu!\nAs a chief operative of the villainous Kisaragi Corporation, Sentouin Roku-gou receives orders to help the organization conquer the entire known universe.",
      "metadata": {
        "doc_index": 72,
        "header_level": 2,
        "header": "## Sentouin, Haken shimasu!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Sentouin, Haken shimasu! - 4 Tasked with infiltrating the kingdom of Grace--a mission that could change the fate of the world--Roku-gou mistakenly believes that his skills as a combatant are superb, fuelling his arrogant attitude.\nTo ensure the success of the mission, Alice Kisaragi, an exceptional android with a youthful appearance named after the company itself, is assigned to be Roku-gou's travel companion.\nUpon their arrival at the outskirts of the kingdom, Alice and Roku-gou encounter Snow, the commander of the country's royal guard.\nSnow leads the pair to a broken legendary artifact, and Roku-gou seizes the opportunity for a long-awaited promotion at his company and changes the recitation for the sacred ritual to an embarrassing phrase.\nAs punishment, the princess of the kingdom forces Roku-gou to become an honorary knight, fulfilling part of his mission.\nHaving infiltrated the kingdom's inner circle, Roku-gou must now help his new employer fight against the Demon Lord's Army, all while perpetuating evil deeds as a combatant of the Kisaragi Corporation.\n[Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nTheme Isekai\n7.14\n403K\nAdd to My List",
      "metadata": {
        "doc_index": 73,
        "header_level": 2,
        "header": "## Sentouin, Haken shimasu! - 4 Tasked with infiltrating the kingdom of Grace--a mission that could change the fate of the world--Roku-gou mistakenly believes that his skills as a combatant are superb, fuelling his arrogant attitude.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Quartet\nTV, 2019 Finished 12 eps, 11 min\nComedy Fantasy\nIsekai Quartet\nIt is a normal day; everyone from deranged military girl Tanya Degurechaff and 16-year-old isekai protagonist Satou Kazuma to expansionist overlord Ainz Ooal Gown and demon sisters Rem and Ram go on with their daily lives. Suddenly, a conspicuous red button begging to be pressed appears before them. Overcome by curiosity, the otherworldly characters push the button, sending them to an unfamiliar world. With no way of escaping, the characters must lead a normal school life and make acquaintances with the others. One thing is certain: the classroom full of fan-favorite eccentric personalities never gets boring! [Written by MAL Rewrite]\nStudio Studio PuYUKAI\nSource Original\nThemes Isekai Parody\n7.37\n401K\nAdd to My List",
      "metadata": {
        "doc_index": 74,
        "header_level": 2,
        "header": "## Isekai Quartet",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Re:Zero kara Hajimeru Isekai Seikatsu 3rd Season\nTV, 2024 Finished 16 eps, 28 min\nDrama Fantasy Suspense\nRe:Zero kara Hajimeru Isekai Seikatsu 3rd Season\nOne year after the events at the Sanctuary, Subaru Natsuki trains hard to better face future challenges. The peaceful days come to an end when Emilia receives an invitation to a meeting in the Watergate City of Priestella from none other than Anastasia Hoshin, one of her rivals in the royal selection. Considering the meeting's significance and the potential dangers Emilia could face, Subaru and his friends accompany her. However, as Subaru reconnects with old associates and companions in Priestella, new formidable foes emerge. Driven by fanatical motivations and engaging in ruthless methods to achieve their ambitions, the new enemy targets Emilia and threaten the very existence of the city. Rallying his allies, Subaru must give his all once more to stop their nefarious goals from becoming a concrete reality. [Written by MAL Rewrite]\nStudio White Fox\nSource Light novel\nThemes Isekai Psychological Time Travel\n8.48\n399K\nAdd to My List",
      "metadata": {
        "doc_index": 75,
        "header_level": 2,
        "header": "## Re:Zero kara Hajimeru Isekai Seikatsu 3rd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Ojisan\nTV, 2022 Finished 13 eps, 24 min\nComedy Fantasy\nIsekai Ojisan\nAfter a fatal encounter with a truck, Takafumi Takaoka's uncle, Yousuke \"Ojisan\" Shibazaki, lies comatose for 17 years. When he finally regains consciousness, Ojisan begins to ramble in a foreign tongue and reveals that he had been transported to a magical world called Gran Bahamal. Takafumi dismisses his uncle's claims as nonsense until an incantation makes a cup of water hover in the air. In a flash of brilliance, the pair creates a YouTube channel to showcase Ojisan's magical abilities. The responsibility now falls on Takafumi's shoulders to acquaint Ojisan with everything that has transpired during his absence, including getting him up to speed with the internet, new technology, and surprisingly, the outcome of the '90s console war--the result of which was especially distressing for a hardcore SEGA fan. With Ojisan's wisdom from his other world experiences, they grow their YouTube channel and tackle online comments and trolls. The journey of this uncle-nephew duo promises to be anything but conventional. [Written by MAL Rewrite]\nStudio Atelier Pontdarc\nSource Web manga\nThemes Adult Cast Isekai Otaku Culture Parody\n7.77\n396K\nAdd to My List",
      "metadata": {
        "doc_index": 76,
        "header_level": 2,
        "header": "## Isekai Ojisan",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kono Subarashii Sekai ni Shukufuku wo! 2: Kono Subarashii Geijutsu ni Shukufuku wo!\nOVA, 2017 Finished 1 ep, 28 min\nAdventure Comedy Fantasy\nKono Subarashii Sekai ni Shukufuku wo! 2: Kono Subarashii Geijutsu ni Shukufuku wo!\nOn one noteworthy day in the Adventurer's Guild, Kazuma Satou encounters someone unexpected--a fan of his named Ran. Surprised that he even has a fan, Kazuma attempts to play it cool to impress her. Unfortunately for him, the guild's receptionist arrives with a request to defeat a giant golem guarding some ancient ruins, and Kazuma accepts only to keep Ran's admiration. Upon Kazuma and his party's successful return from the ruins, Kazuma continues to shamelessly brag to Ran. Capitalizing on his desperation, the receptionist approaches him with another quest that requires him to return to the same ruins. Hoping to find valuable treasures, Kazuma once again convinces his party to join him--but this time, he may be biting off more than he can chew. [Written by MAL Rewrite]\nStudio Studio Deen\nSource Light novel\nThemes Isekai Parody\n8.01\n393K\nAdd to My List",
      "metadata": {
        "doc_index": 77,
        "header_level": 2,
        "header": "## Kono Subarashii Sekai ni Shukufuku wo! 2: Kono Subarashii Geijutsu ni Shukufuku wo!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Outbreak Company\nTV, 2013 Finished 12 eps, 24 min\nComedy Fantasy\nOutbreak Company\nShinichi Kanou is a shut-in otaku with a vast knowledge of anime, manga, and video games. One day, after applying for a job in hopes of escaping his secluded lifestyle, he is kidnapped and transported to the Eldant Empire--a fantasy world filled with elves, dragons, and dwarves. Trapped in this strange land, Shinichi is given an unlikely task by the Japanese government: to spread otaku culture across the realm by becoming an \"Otaku Missionary.\" To accomplish his mission, Shinichi has the full support of the Japanese government, as well as the half-elf maid Myucel and Princess Petralka of the Eldant Empire. Together with this ragtag bunch, he will overcome the obstacles of politics, social classes, and ethnic discrimination to promote the ways of the otaku in this holy land. [Written by MAL Rewrite]\nStudio feel.\nSource Light novel\nThemes Harem Isekai Otaku Culture Parody\n7.16\n375K\nAdd to My List",
      "metadata": {
        "doc_index": 78,
        "header_level": 2,
        "header": "## Outbreak Company",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Naruto: Shippuuden Movie 6 - Road to Ninja - 1 ## Naruto: Shippuuden Movie 6 - Road to Ninja\nMovie, 2012 Finished 1 ep, 109 min\nAction Adventure Fantasy\nNaruto: Shippuuden Movie 6 - Road to Ninja\nReturning home to Konohagakure, the young ninja celebrate defeating a group of supposed Akatsuki members.\nNaruto Uzumaki and Sakura Haruno, however, feel differently.\nNaruto is jealous of his comrades' congratulatory families, wishing for the presence of his own parents.\nSakura, on the other hand, is angry at her embarrassing parents, and wishes for no parents at all.\nThe two clash over their opposing ideals, but are faced with a more pressing matter when the masked Madara Uchiha suddenly appears and transports them to an alternate world.\nIn this world, Sakura's parents are considered heroes--for they gave their lives to protect Konohagakure from the Nine-Tailed Fox attack 10 years ago.\nConsequently, Naruto's parents, Minato Namikaze and Kushina Uzumaki, are alive and well.\nUnable to return home or find the masked Madara, Naruto and Sakura stay in this new world and enjoy the changes they have always longed for.",
      "metadata": {
        "doc_index": 79,
        "header_level": 2,
        "header": "## Naruto: Shippuuden Movie 6 - Road to Ninja - 1 ## Naruto: Shippuuden Movie 6 - Road to Ninja",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Naruto: Shippuuden Movie 6 - Road to Ninja - 9 All seems well for the two ninja, until an unexpected threat emerges that pushes Naruto and Sakura to not only fight for the Konohagakure of the alternate world, but also to find a way back to their own.\n[Written by MAL Rewrite]\nStudio Pierrot\nSource Manga\nTheme Isekai\nDemographic Shounen\n7.68\n366K\nAdd to My List",
      "metadata": {
        "doc_index": 80,
        "header_level": 2,
        "header": "## Naruto: Shippuuden Movie 6 - Road to Ninja - 9 All seems well for the two ninja, until an unexpected threat emerges that pushes Naruto and Sakura to not only fight for the Konohagakure of the alternate world, but also to find a way back to their own.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensura Nikki: Tensei shitara Slime Datta Ken\nTV, 2021 Finished 12 eps, 23 min\nComedy Fantasy\nTensura Nikki: Tensei shitara Slime Datta Ken\nIn between slaying monsters and negotiating with neighboring countries, Rimuru Tempest has his hands full attending to his kingdom alongside day-to-day matters. But whether it's expanding the farms in the summer heat or shoveling snow in the chilly winter, no task is too big for Rimuru and his friends! [Written by MAL Rewrite]\nStudio 8bit\nSource Manga\nThemes Isekai Reincarnation\nDemographic Shounen\n7.59\n365K\nAdd to My List",
      "metadata": {
        "doc_index": 81,
        "header_level": 2,
        "header": "## Tensura Nikki: Tensei shitara Slime Datta Ken",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Cheat Magician\nTV, 2019 Finished 12 eps, 23 min\nAction Adventure Fantasy\nIsekai Cheat Magician\nRegular high schooler Taichi Nishimura and his childhood friend, Rin Azuma, are on their way to school one ordinary morning. Suddenly, a glowing light envelops them, transporting them to a fantasy world full of magical creatures. Upon their arrival, Taichi and Rin are threatened by a beast. They are promptly saved by a group of adventurers, who advise the pair that traveling unarmed and inexperienced makes them vulnerable to the recently increasing monster attacks. Taichi and Rin are directed to the Guild, where they can determine their magical aptitude and register as adventurers. However, the test they take reveals an unprecedented result: Taichi and Rin possess extraordinary powers that far surpass the standard mage, instantly transforming them from typical high school students to the ultimate cheat magicians. Taichi and Rin learn to grasp the full extent of their powers and familiarize themselves with their new world. However, while the duo seeks to uncover the reason behind their transportation and a possible way back to their original world, unexpected trouble lurks in the shadows. [Written by MAL Rewrite]\nStudio Encourage Films\nSource Light novel\nTheme Isekai\n5.48\n351K\nAdd to My List",
      "metadata": {
        "doc_index": 82,
        "header_level": 2,
        "header": "## Isekai Cheat Magician",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Otome Game Sekai wa Mob ni Kibishii Sekai desu\nTV, 2022 Finished 12 eps, 23 min\nAction Fantasy Romance\nOtome Game Sekai wa Mob ni Kibishii Sekai desu\nBlackmailed into playing a dating simulator set in a matriarchy, an ordinary man must put up with the unbearable and convoluted world until he clears the game. After countless days of grinding, he finally manages to beat it, but his hardcore gaming comes at a cost: extreme sleep deprivation and hunger. While heading out to the convenience store to solve one of these problems, the man tumbles down the stairs and falls unconscious, only to wake up to the worst possible realization--he has been reincarnated into the game as the mob character Leon Fou Bartfort. Now trapped in a world he despises, Leon must use his knowledge of the game to navigate through the plot safely and sustain himself in a society where the odds are heavily stacked against him. [Written by MAL Rewrite]\nStudio ENGI\nSource Light novel\nThemes Harem Isekai Mecha Reincarnation School\n7.32\n351K\nAdd to My List",
      "metadata": {
        "doc_index": 83,
        "header_level": 2,
        "header": "## Otome Game Sekai wa Mob ni Kibishii Sekai desu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta - 1 ## Isekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta\nTV, 2023 Finished 13 eps, 24 min\nAction Adventure Fantasy\nIsekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta\nAll his life, Yuuya Tenjou has been the subject of resentment and contempt from everyone around him, even from his parents.\nTo make matters worse, his grandfather--the only person who ever showed him affection--suddenly dies, leaving Yuuya truly alone.\nDespite facing many adversities, Yuuya does what he can to offer kindness to those who need it--but even the most good-natured people can only tolerate so much abuse.\nJust when he reaches his breaking point, a flicker of hope appears in the form of a hidden door in his bathroom.\nThis door provides two-way access to an abandoned house in another world, where he instantly gains game-like stats and skills.\nMoreover, the house once belonged to a sage, which gives Yuuya access to remarkable weapons, equipment, and crops with extraordinary effects.\nWith these newfound blessings, the once-undesirable Yuuya may just reach his true potential and become unstoppable.",
      "metadata": {
        "doc_index": 84,
        "header_level": 2,
        "header": "## Isekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta - 1 ## Isekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta - 8 [Written by MAL Rewrite]\nStudio Millepensee\nSource Light novel\nThemes Isekai School\n6.34\n351K\nAdd to My List",
      "metadata": {
        "doc_index": 85,
        "header_level": 2,
        "header": "## Isekai de Cheat Skill wo Te ni Shita Ore wa, Genjitsu Sekai wo mo Musou Suru: Level Up wa Jinsei wo Kaeta - 8 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Sonny Boy\nTV, 2021 Finished 12 eps, 24 min\nAward Winning Mystery\nSonny Boy\nThirty-six students find themselves and their school building suddenly adrift in a void-like dimension. When supernatural powers awaken in some of them, a sense of detachment begins to divide the group. Despite the student council's attempts to impose order, they clash with the students possessing special abilities, who rebel against their strict control. This conflict leads them to discover that this world has its own set of rules--and following them is necessary for survival. After one of the students decides to take a leap of faith, the school switches dimensions once again. While they deal with the unique challenges and circumstances that each world presents, the students must unravel the mysterious phenomenon and find a way back home. [Written by MAL Rewrite]\nStudio Madhouse\nSource Original\nThemes Isekai Super Power\n7.82\n347K\nAdd to My List",
      "metadata": {
        "doc_index": 86,
        "header_level": 2,
        "header": "## Sonny Boy",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Gaikotsu Kishi-sama, Tadaima Isekai e Odekakechuu\nTV, 2022 Finished 12 eps, 23 min\nAction Adventure Fantasy\nGaikotsu Kishi-sama, Tadaima Isekai e Odekakechuu\nAfter falling asleep while playing an online game, a man wakes up and finds himself transported to that game's world as his in-game character, Arc. He wastes no time adjusting to his new environment, but soon realizes that he is using the skeleton avatar he chose when creating his character, which forces him to hide his visage to avoid unwanted attention. Arc goes to the nearby castle town of Luvierte, hoping to become an adventurer and take on quests to earn money. With his overpowered abilities, Arc embarks on a fantastical journey--exploring diverse territories, looting various monsters, and helping people get out of sticky situations. However, his seemingly innocuous actions may soon involve him in a brewing large-scale conflict that will forever alter the fate of the realm. [Written by MAL Rewrite]\nStudios HORNETS Studio Kai\nSource Light novel\nTheme Isekai\n7.14\n347K\nAdd to My List",
      "metadata": {
        "doc_index": 87,
        "header_level": 2,
        "header": "## Gaikotsu Kishi-sama, Tadaima Isekai e Odekakechuu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen - 1 ## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen\nTV, 2019 Finished 14 eps, 23 min\nFantasy\nHonzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen\nUrano Motosu loves books and has an endless desire to read literature, no matter the subject.\nShe almost fulfills her dream job of becoming a librarian before her life is ended in an accident.\nAs she draws her last breath, she wishes to be able to read more books in her next life.\nAs if fate was listening to her prayer, she wakes up reincarnated as Myne--a frail five-year-old girl living in a medieval era.\nWhat immediately comes to her mind is her passion.\nShe tries to find something to read, only to become frustrated by the lack of books at her disposal.\nWithout the printing press, books have to be written and copied by hand, making them very expensive; as such, only a few nobles can afford them--but this won't stop Myne.\nShe will prove that her will to read is unbreakable, and if there are no books around, she will make them herself!",
      "metadata": {
        "doc_index": 88,
        "header_level": 2,
        "header": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen - 1 ## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen - 9 [Written by MAL Rewrite]\nStudio Ajia-do\nSource Light novel\nThemes Isekai Reincarnation\n7.97\n342K\nAdd to My List",
      "metadata": {
        "doc_index": 89,
        "header_level": 2,
        "header": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen - 9 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Saihate no Paladin\nTV, 2021 Finished 12 eps, 23 min\nAction Adventure Fantasy\nSaihate no Paladin\nBorn into a new world after a life of stagnancy, Will awakens to the faces of a skeleton, a ghost, and a mummy. Living in the ruins of a city long fallen, the three raise Will as their own. The skeleton-- Blood--teaches him to fight; the ghost--Gus--teaches him magic; and the mummy--Mary--teaches him religion and responsibility. Most importantly, they all teach him love. As Will grows up and learns about the world he was born into, he prepares for the day when he must finally set out on his own. For Will, this journey includes a lifelong promise. At their coming-of-age, every adult is required to swear an oath to the god of their choice, with the strength of the pledge affecting the degree of their sworn god's blessing. With his departure approaching, Will must prepare to accept the truth of his undead guardians and embark into a world that even they don't know the state of. Will discovers, however, that every oath must be fulfilled, one way or another. [Written by MAL Rewrite]\nStudio Children's Playground Entertainment\nSource Light novel\nThemes Isekai Reincarnation\n6.87\n335K\nAdd to My List",
      "metadata": {
        "doc_index": 90,
        "header_level": 2,
        "header": "## Saihate no Paladin",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## 100-man no Inochi no Ue ni Ore wa Tatteiru - 1 ## 100-man no Inochi no Ue ni Ore wa Tatteiru\nTV, 2020 Finished 12 eps, 23 min\nAction Adventure Drama Fantasy\n100-man no Inochi no Ue ni Ore wa Tatteiru\nYuusuke Yotsuya has always disliked Tokyo, but he especially hates the people who live in it.\nHe would rather thrive in a virtual world than try to get along with those around him.\nAt the end of one school day, he sees the popular athlete Iu Shindou talking to Kusue Hakozaki, who spends less time in school due to illness.\nBut when he looks away from the two and back again, they have seemingly disappeared.\nMere moments later, Yotsuya enters a state of free-fall, and the world begins to change around him.\nDropping into a large pool of water, the first thing he sees when he comes to his senses is an assortment of enormous monsters.\nHe soon finds out that he has been brought into a game world by Shindou and Hakozaki and that he must complete a quest within 14 days.\nThere is one thing that separates this world from the real world: anyone who dies will be brought back to life in 30 seconds as long as one party member is alive.",
      "metadata": {
        "doc_index": 91,
        "header_level": 2,
        "header": "## 100-man no Inochi no Ue ni Ore wa Tatteiru - 1 ## 100-man no Inochi no Ue ni Ore wa Tatteiru",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## 100-man no Inochi no Ue ni Ore wa Tatteiru - 9 Tasked with numerous quests that increase in difficulty over time, Yotsuya, Shindou, and Hakozaki attempt to discover the mystery behind the perplexing game world.\n[Written by MAL Rewrite]\nStudio Maho Film\nSource Manga\nTheme Isekai\nDemographic Shounen\n6.52\n318K\nAdd to My List",
      "metadata": {
        "doc_index": 92,
        "header_level": 2,
        "header": "## 100-man no Inochi no Ue ni Ore wa Tatteiru - 9 Tasked with numerous quests that increase in difficulty over time, Yotsuya, Shindou, and Hakozaki attempt to discover the mystery behind the perplexing game world.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Re:Zero kara Hajimeru Isekai Seikatsu - Memory Snow\nMovie, 2018 Finished 1 ep, 60 min\nFantasy\nRe:Zero kara Hajimeru Isekai Seikatsu - Memory Snow\nSubaru Natsuki finally gets to take a breather, but he does not waste any time as he prepares for a date with his beloved Emilia. He scouts the nearby village for the right dating spot, and with the help of the village children, he finds a wonderful location. With that, he is well prepared for his date! Unfortunately for Subaru, cold weather suddenly sweeps across Roswaal's mansion on his important day, leaving him with no choice but to postpone the date. Overnight, it becomes even colder and unbearable. Subaru must get to the bottom of this because, at this rate, his date will be the least of his worries. [Written by MAL Rewrite]\nStudio White Fox\nSource Light novel\nTheme Isekai\n7.57\n315K\nAdd to My List",
      "metadata": {
        "doc_index": 93,
        "header_level": 2,
        "header": "## Re:Zero kara Hajimeru Isekai Seikatsu - Memory Snow",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Ken deshita\nTV, 2022 Finished 12 eps, 23 min\nAction Adventure Fantasy\nTensei shitara Ken deshita\nA nameless sword wakes up to discover he has been reincarnated from his former life as a human. With his power of telekinesis, he moves around this new world, acquiring several skills and abilities. When the sword comes upon a forest filled with monsters, he meets a young girl fleeing from a beast. Grabbing the sword, the girl easily defeats the monster. After introducing herself as Fran, she names the sword \"Shishou\" and officially becomes his wielder. The two set out to become adventurers, but unfortunately for Fran, she is a member of the Black Cat Tribe--a Beastkin group with a bad reputation. No member of this tribe has ever evolved into a mightier beast, but Fran plans to be the first and achieve her parents' dream. As Shishou promises to remain her sword until she attains her goal, they form an unstoppable partnership of impressive strength. [Written by MAL Rewrite]\nStudio C2C\nSource Light novel\nThemes Isekai Reincarnation\n7.51\n312K\nAdd to My List",
      "metadata": {
        "doc_index": 94,
        "header_level": 2,
        "header": "## Tensei shitara Ken deshita",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Youjo Senki Movie\nMovie, 2019 Finished 1 ep, 98 min\nAction Fantasy\nYoujo Senki Movie\nWith its armies sweeping across the continent, the Empire seems unstoppable. After securing victory over the remnants of the Republic's army, the Empire's ultimate victory is finally within reach. However, dark clouds are gathering in the East. The communist-led Russy Federation is mustering troops on its western border, preparing to enter the war. Supported by a detachment of Allied volunteer magicians--among whom is Mary Sioux, the daughter of a soldier killed by Tanya Degurechaff--the Federation is determined to spread the communist creed and bring the Empire to its knees. Meanwhile, Tanya and her battalion return to the imperial capital from the southern front. Upon their arrival, they are tasked with investigating troop movements on the border with the Federation. Any escalation of violence at this point may lead to new conflicts, plunging the world into a devastating global war. Will the Empire eventually emerge victorious from its struggle, or will it crumble in the face of superior enemies and radically different ideologies? [Written by MAL Rewrite]\nStudio Nut\nSource Light novel\nThemes Isekai Military Reincarnation\n8.23\n307K\nAdd to My List",
      "metadata": {
        "doc_index": 95,
        "header_level": 2,
        "header": "## Youjo Senki Movie",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Fate/Grand Order: Zettai Majuu Sensen Babylonia - 1 ## Fate/Grand Order: Zettai Majuu Sensen Babylonia\nTV, 2019 Finished 21 eps, 23 min\nAction Fantasy\nFate/Grand Order: Zettai Majuu Sensen Babylonia\nA.D. 2016, the foundations of humanity have been incinerated by the Mage King Solomon.\nChaldea, a secret mages organization with the mission to preserve humanity's future, foresaw mankind's extinction in 2015.\nThus commenced the operation to repair the Singularities in history caused by Holy Grails dispersed across time and space--Operation Grand Order.\nUsing the Rayshift time travel technology, Chaldea's last master Ritsuka Fujimaru and his demi-servant Mash Kyrielight have traveled to and resolved six Singularities.\nNow, they depart for their most dangerous destination yet: a civilization in the Age of Gods, B.C.\n2655 Mesopotamia.\nRitsuka and Mash soon discover that Demonic Beasts roam the land, attacking people and towns.\nAmidst chaos and terror lies humanity's last defense--Uruk, a fortress city that acts as the frontline for the battle against the beasts.\nThe battlefront is commanded by none other than King Gilgamesh, the King of Heroes, who sought aid from Heroic Spirits and took on the role of a mage to protect his city.",
      "metadata": {
        "doc_index": 96,
        "header_level": 2,
        "header": "## Fate/Grand Order: Zettai Majuu Sensen Babylonia - 1 ## Fate/Grand Order: Zettai Majuu Sensen Babylonia",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Fate/Grand Order: Zettai Majuu Sensen Babylonia - 10 Along with Gilgamesh and the summoned servants, Ritsuka and Mash must protect Uruk against the magical beasts' onslaught and defeat the Three Goddess Alliance who aims to eradicate humankind; all the while, a greater threat looms over Uruk, preparing for its awakening.\n[Written by MAL Rewrite]\nStudio CloverWorks\nSource Game\nTheme Isekai\n7.94\n299K\nAdd to My List",
      "metadata": {
        "doc_index": 97,
        "header_level": 2,
        "header": "## Fate/Grand Order: Zettai Majuu Sensen Babylonia - 10 Along with Gilgamesh and the summoned servants, Ritsuka and Mash must protect Uruk against the magical beasts' onslaught and defeat the Three Goddess Alliance who aims to eradicate humankind; all the while, a greater threat looms over Uruk, preparing for its awakening.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tsuki ga Michibiku Isekai Douchuu 2nd Season\nTV, 2024 Finished 25 eps, 23 min\nAction Adventure Comedy Fantasy\nTsuki ga Michibiku Isekai Douchuu 2nd Season\nDespite a rough start, Makoto Misumi's life in another world takes a positive turn when he meets more demihumans who recognize his presence. Now as the leader of a fast-growing demihuman community, Makoto wishes to make human society more accepting of them and thus builds a business showcasing the demihumans' abilities. To extend his reach further, Makoto enrolls at the Rotsgard Academy to learn magic and expand his business venture there. Meanwhile, the goddess who summoned and forsaken Makoto had brought two other people to her world shortly after sending him away, making them heroes of their respective nations. Given enough time, Makoto's path will intertwine with both of these heroes, which may cause the world to take a drastic direction. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nTheme Isekai\n7.84\n293K\nAdd to My List",
      "metadata": {
        "doc_index": 98,
        "header_level": 2,
        "header": "## Tsuki ga Michibiku Isekai Douchuu 2nd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Choujin Koukousei-tachi wa Isekai demo Yoyuu de Ikinuku you desu! - 2 TV, 2019 Finished 12 eps, 23 min\nAction Adventure Fantasy\nChoujin Koukousei-tachi wa Isekai demo Yoyuu de Ikinuku you desu!\nSeven Japanese high school students enjoy international renown for their remarkable talents.\nOne day, these friends survive a plane crash only to find themselves in the medieval fantasy world of Freyjagard, where two human races live side by side in a feudal society: the byuma, who have animal features and formidable strength, and the hyuma, who have a small chance of magical aptitude.\nAfter being rescued by the byuma Winona and her adopted elven daughter Lyrule, the group pledges to use their advanced skills and knowledge to pay back the people of Elm Village for their hospitality and find a way to return back home.\nTsukasa Mikogami, the prime minister of Japan, acts as the leader of these young geniuses and organizes their efforts to intervene in Freyjagard and gather the information and resources necessary for achieving their goals.\nBelieving that there is a connection between their current situation and an ancient legend about seven heroes from another world who defeated an evil dragon, Tsukasa directs the others to learn about the culture around them and search for any clues leading them back to Earth.\nBut he also gives another instruction: to take it nice and easy, lest they ruin this world by giving it their all.",
      "metadata": {
        "doc_index": 99,
        "header_level": 2,
        "header": "## Choujin Koukousei-tachi wa Isekai demo Yoyuu de Ikinuku you desu! - 2 TV, 2019 Finished 12 eps, 23 min",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Choujin Koukousei-tachi wa Isekai demo Yoyuu de Ikinuku you desu! - 9 [Written by MAL Rewrite]\nStudio Project No.9\nSource Light novel\nTheme Isekai\n6.36\n290K\nAdd to My List",
      "metadata": {
        "doc_index": 100,
        "header_level": 2,
        "header": "## Choujin Koukousei-tachi wa Isekai demo Yoyuu de Ikinuku you desu! - 9 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Meikyuu de Harem wo\nTV, 2022 Finished 12 eps, 24 min\nAction Adventure Fantasy Erotica\nIsekai Meikyuu de Harem wo\nOne day, high school student Michio Kaga attempts to start a strange online game he found while browsing the internet. Instead, he gets transported to a rural village in the game's world, equipped with special skills and an overpowered sword. After collecting his thoughts, he finds himself battling against bandits and soon realizes that he cannot log out. Resigning himself to fate and accepting this reality, Michio sets out on a journey--enjoying his new life, conquering dungeons to earn money, and building a harem to satisfy all his manly desires. [Written by MAL Rewrite]\nStudio Passione\nSource Light novel\nThemes Harem Isekai\n6.54\n282K\nAdd to My List",
      "metadata": {
        "doc_index": 101,
        "header_level": 2,
        "header": "## Isekai Meikyuu de Harem wo",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Knight's & Magic\nTV, 2017 Finished 13 eps, 24 min\nAction Fantasy\nKnight's & Magic\nHaving died in a car accident, Tsubasa Kurata--an otaku from modern Japan--is reborn in the Fremmevilla Kingdom, a medieval world where powerful mechs called Silhouette Knights are used to fight horrific demonic beasts. Born into a noble family under the name of Ernesti Echevarria and bestowed with prodigious magical abilities, he enrolls into Royal Laihaila Academy. This school of magic trains young men and women on how to pilot the Silhouette Knights, prepping them to protect the kingdom from threats, both demonic and human. Ernesti teams up with the twins named Adeltrud and Archid Olter with the goal to create his own Silhouette Knight one day, a feat unheard of for several centuries. [Written by MAL Rewrite]\nStudio 8bit\nSource Light novel\nThemes Isekai Mecha Reincarnation School\n7.07\n281K\nAdd to My List",
      "metadata": {
        "doc_index": 102,
        "header_level": 2,
        "header": "## Knight's & Magic",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tondemo Skill de Isekai Hourou Meshi\nTV, 2023 Finished 12 eps, 23 min\nAdventure Comedy Fantasy Gourmet\nTondemo Skill de Isekai Hourou Meshi\nSalaryman Tsuyoshi Mukouda is accidentally summoned as a hero to the Kingdom of Reijseger in another world to help defend against their enemies. Wary of the royal family's true intentions, Mukouda is able to talk his way out of the situation due to his non-combat skill, \"Online Supermarket,\" which is deemed useless. However, this power proves to be anything but useless. With this ability, Mukouda is able to cheaply purchase food products and utensils from Japan--most of which are considered luxuries in this world. As Mukouda cooks up a storm using his ability, he catches the eye of the fearsome mythical wolf Fel. The legendary beast swiftly negotiates a contract to become Mukouda's familiar, unable to resist the delicious dishes. With Fel by his side, Mukouda travels the world, earning his keep as an adventurer and merchant all the while enjoying delectable meals. [Written by MAL Rewrite]\nStudio MAPPA\nSource Light novel\nTheme Isekai\n7.65\n281K\nAdd to My List",
      "metadata": {
        "doc_index": 103,
        "header_level": 2,
        "header": "## Tondemo Skill de Isekai Hourou Meshi",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Genjitsu Shugi Yuusha no Oukoku Saikenki Part 2\nTV, 2022 Finished 13 eps, 24 min\nAction Fantasy Romance\nGenjitsu Shugi Yuusha no Oukoku Saikenki Part 2\nTogether with his talented aides, the \"Realist Hero\" Kazuya Souma continues his quest of reinvigorating the Elfrieden Kingdom through administrative reform. Having successfully conquered Van--the capital city of the Principality of Amidonia--Kazuya now faces the envoy from Gran Chaos Empire, who wishes to impose punishment for breaching the ban on war established by the Mankind Declaration Treaty. Despite the dire situation, Kazuya sees a path to avoid unnecessary conflict whilst gaining new allies. With his plan being seemingly perfect, the only barrier to success is gaining approval from the envoy. [Written by MAL Rewrite]\nStudio J.C.Staff\nSource Light novel\nThemes Harem Isekai Military\n7.43\n280K\nAdd to My List",
      "metadata": {
        "doc_index": 104,
        "header_level": 2,
        "header": "## Genjitsu Shugi Yuusha no Oukoku Saikenki Part 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Shokudou\nTV, 2017 Finished 12 eps, 23 min\nFantasy Gourmet Slice of Life\nIsekai Shokudou\nWestern Restaurant Nekoya is a popular eatery located on a street corner in a Tokyo shopping district. Serving both traditional Japanese fare as well as Western dishes, this eating establishment is popular among Tokyo's residents. But this seemingly ordinary restaurant is also popular with another type of clientele... While the restaurant is thought to be closed on Saturdays, the truth is that on this special day each week, its doors are instead opened to the inhabitants of other worlds. From dragons and elves to fairies and mages, this restaurant has no shortage of strange customers. Nevertheless, the enigmatic chef known only as \"Master\" will be waiting to serve up their favorite dishes with a kind smile and keep them coming back for many more Saturdays to come. [Written by MAL Rewrite]\nStudio SILVER LINK.\nSource Light novel\nThemes Isekai Workplace\n7.41\n274K\nAdd to My List",
      "metadata": {
        "doc_index": 105,
        "header_level": 2,
        "header": "## Isekai Shokudou",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Chiyu Mahou no Machigatta Tsukaikata\nTV, 2024 Finished 13 eps, 23 min\nAction Adventure Fantasy\nChiyu Mahou no Machigatta Tsukaikata\nKen Usato, an ordinary high schooler, wishes for something fantastical to occur in his unremarkable life. Such an opportunity arrives when he is transported to another world alongside Kazuki Ryuusen and Suzune Inukami, two prodigious members of his school's student council. Arriving in Llinger Kingdom, the three are deemed to be the heroes tasked with stopping the impending invasion by the Demon Lord's army. However, this is a misunderstanding--Usato was summoned by accident and, unlike his two friends, is not one of the heroes. Despite this disheartening revelation, Usato learns that he has an aptitude for the extremely rare healing magic. This catches the attention of Rose, the intimidating captain of the kingdom's Rescue Team, who forcibly takes custody of Usato to mold him into a full-fledged healer. As he undergoes grueling training under Rose's supervision, Usato resolves to become capable enough to protect his friends from the dangers of this world. [Written by MAL Rewrite]\nStudios Shin-Ei Animation Studio Add\nSource Light novel\nTheme Isekai\n7.53\n274K\nAdd to My List",
      "metadata": {
        "doc_index": 106,
        "header_level": 2,
        "header": "## Chiyu Mahou no Machigatta Tsukaikata",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Maou-sama, Retry!\nTV, 2019 Finished 12 eps, 23 min\nAction Adventure Fantasy\nMaou-sama, Retry!\nAkira Oono is an ordinary working adult who manages the MMORPG Infinity Game. Fifteen years after creating the game, Oono decides to shut the servers down once and for all. However, as the clock strikes midnight, he somehow finds himself in the body of middle-aged Hakuto Kunai, Infinity Game's Demon Lord! Soon after his mysterious transportation, he witnesses the demon Greole chasing after a little girl named Aku. Although he effortlessly dispatches the creature, Hakuto is still concerned; after all, he does not remember creating the girl or the demon! Doubting whether he truly is in the world of his creation, Hakuto decides to investigate. Bringing Aku along as his guide and companion, Hakuto sets out on a journey to find out exactly who or what summoned him to this fantasy world--all while leaving chaos and destruction in his wake. [Written by MAL Rewrite]\nStudio EKACHI EPILKA\nSource Light novel\nTheme Isekai\n6.55\n272K\nAdd to My List",
      "metadata": {
        "doc_index": 107,
        "header_level": 2,
        "header": "## Maou-sama, Retry!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kuro no Shoukanshi\nTV, 2022 Finished 12 eps, 23 min\nAction Adventure Fantasy\nKuro no Shoukanshi\nTo prepare for reincarnation in another world, Kelvin gives up select memories from his previous life in exchange for powerful abilities, additional skill points, and an S-class summoner title. As a bonus, the goddess facilitating his rebirth, Melfina, offers him a choice of any companion to give him a head start in his summoner role. Kelvin--who has fallen head over heels for Melfina at first sight--promptly chooses the deity, confident that his passionate feelings for her will resurface even without all of his memories. Kelvin embarks on his exciting new journey with Melfina as his guide. However, in order to summon his beloved goddess' physical form, he needs to acquire significant amounts of mana points--and the best way to accomplish this is to level up by fighting strong enemies and making contracts with even stronger companions. [Written by MAL Rewrite]\nStudio Satelight\nSource Light novel\nThemes Isekai Reincarnation\n7.04\n270K\nAdd to My List",
      "metadata": {
        "doc_index": 108,
        "header_level": 2,
        "header": "## Kuro no Shoukanshi",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Hachi-nan tte, Sore wa Nai deshou!\nTV, 2020 Finished 12 eps, 23 min\nAction Fantasy\nHachi-nan tte, Sore wa Nai deshou!\nWaking up in a new world, 25-year-old Shingo Ichinomiya realizes that he is in the body of a six-year-old. Retaining memories of his stressful life working at a firm company, Shingo learns that the person he is occupying is Wendelin Von Benno Baumeister, the eighth son of a poor noble family living in the countryside. Awoken to his bizarre situation, Wendelin strives to change his financial and social status for the better. His newly discovered great magical aptitude may prove to be just what he needs to achieve that goal. [Written by MAL Rewrite]\nStudios Shin-Ei Animation SynergySP\nSource Light novel\nThemes Isekai Reincarnation\n6.27\n261K\nAdd to My List",
      "metadata": {
        "doc_index": 109,
        "header_level": 2,
        "header": "## Hachi-nan tte, Sore wa Nai deshou!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Otome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta... X\nTV, 2021 Finished 12 eps, 23 min\nComedy Fantasy Romance\nOtome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta... X\nWith no more death flags in sight, personable but dense Catarina Claes is finally able to lead a peaceful life surrounded by all of her friends and family. For that reason, she is determined to enjoy the school festival to the fullest without any concern on her mind. Unbeknownst to her, however, the story of Fortune Lover--the game she used to play--has yet to end. Even more characters make an appearance, each with their own agenda to fulfill, and new mysteries await Katarina and those she loves. Will there be any way to avoid a bad ending when Catarina cannot remember what happens next? [Written by MAL Rewrite]\nStudio SILVER LINK.\nSource Light novel\nThemes Isekai Reverse Harem School Villainess\nDemographic Shoujo\n7.26\n260K\nAdd to My List",
      "metadata": {
        "doc_index": 110,
        "header_level": 2,
        "header": "## Otome Game no Hametsu Flag shika Nai Akuyaku Reijou ni Tensei shiteshimatta... X",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Nonbiri Nouka\nTV, 2023 Finished 12 eps, 23 min\nFantasy Slice of Life\nIsekai Nonbiri Nouka\nDuring the final years of his life, Hiraku Machio remained confined to a hospital bed with a terminal illness until he finally passed away. Taking pity on the unfair life he lived, a god decides to reincarnate Hiraku in another world where he can live as he pleases. Wanting to try farming in this new life, he is bestowed with an all-in-one \"Almighty Farming Tool\" that can transform into any useful implement he wishes. Hiraku is then transported to a forest seemingly far from civilization. Here, he plans to build and farm everything from scratch--gradually developing the lifeless area into a thriving new society. [Written by MAL Rewrite]\nStudio Zero-G\nSource Light novel\nTheme Isekai\n7.54\n254K\nAdd to My List",
      "metadata": {
        "doc_index": 111,
        "header_level": 2,
        "header": "## Isekai Nonbiri Nouka",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Slime Datta Ken OVA\nOVA, 2019 Finished 5 eps, 23 min\nAction Comedy Fantasy\nTensei shitara Slime Datta Ken OVA\nOne day, Shuna and Shion are fighting over Rimuru's squishy slime body as usual. Rimuru figures that giving them each a body double of himself would solve the conflict, but when he imagines some of his other friends asking him to do the same for them, he quickly drops that plan. Then he comes up with the idea to make a cushion in the shape of his slime form. He travels around Tempest to see if his friends know of any good materials he can use, and he learns that a special type of sand found along a lake shore in the forest is exactly what he's looking for. So he sets out to collect some sand... but a monster is waiting for him by the lake! What's more, Milim hears about his plan for a picnic and comes racing down from the sky! (Source: Crunchyroll)\nStudio 8bit\nSource Manga\nThemes Isekai Reincarnation\n7.48\n251K\nAdd to My List",
      "metadata": {
        "doc_index": 112,
        "header_level": 2,
        "header": "## Tensei shitara Slime Datta Ken OVA",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Saikyou Onmyouji no Isekai Tenseiki\nTV, 2023 Finished 13 eps, 23 min\nAction Adventure Fantasy\nSaikyou Onmyouji no Isekai Tenseiki\nDespite standing at the zenith as the strongest exorcist, Haruyoshi Kuga sought even greater power, which led to his demise at the hands of those who envied his might. As he draws his last breath, he casts a spell that allows him to reincarnate and swears to become more cunning, hoping that all his efforts will prove useful in his next life. Haruyoshi is soon reborn in another world as Seika Lamprogue, an illegitimate son of a noble family that prides itself on magic. However, his new family largely ignores him due to his lineage and magic deficiency. Nevertheless, the unbothered Seika leverages the knowledge from his previous life to make numerous valuable allies. As he begins to explore the true limits of his abilities, Seika must also be wary of the consequences that tarnished his past and avoid repeating the same mistakes. [Written by MAL Rewrite]\nStudio Studio Blanc.\nSource Light novel\nThemes Isekai Reincarnation\n7.12\n250K\nAdd to My List",
      "metadata": {
        "doc_index": 113,
        "header_level": 2,
        "header": "## Saikyou Onmyouji no Isekai Tenseiki",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Yakkyoku - 1 ## Isekai Yakkyoku\nTV, 2022 Finished 12 eps, 23 min\nFantasy\nIsekai Yakkyoku\nWorld-class medical researcher Kanji Yakutani lost his little sister to a tumor years ago due to ineffective treatment.\nTo honor her legacy, he has dedicated his research to developing new medications for such conditions.\nBut as fate would have it, he overworks himself and passes away at the age of 31, only to be given a second chance at life in another world.\nWhen he wakes up, Kanji finds himself in the body of a 10-year-old boy named Falma de Medicis, the son of an esteemed family of medical practitioners in the Sain Fleuve Empire.\nBearing the mark of a deity's divine blessing, Falma is capable of performing a unique divine art, allowing him to create and reduce any substance with the knowledge of its chemical properties.\nAfter reading through some pharmacology books, Falma realizes that this world is operating on similar medical practices as in ancient times.\nHe also learns that medicine is an exclusive privilege to the nobility, depriving commoners of proper medical care.\nUsing the knowledge from his past life and the divine abilities granted to him, Falma resolves to make medicine available to those who need it--irrespective of class.",
      "metadata": {
        "doc_index": 114,
        "header_level": 2,
        "header": "## Isekai Yakkyoku - 1 ## Isekai Yakkyoku",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Yakkyoku - 9 [Written by MAL Rewrite]\nStudio Diomedea\nSource Light novel\nThemes Isekai Medical Reincarnation\n7.27\n249K\nAdd to My List",
      "metadata": {
        "doc_index": 115,
        "header_level": 2,
        "header": "## Isekai Yakkyoku - 9 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Isekai Quartet 2\nTV, 2020 Finished 12 eps, 11 min\nComedy Fantasy\nIsekai Quartet 2\nDespite completing all the tasks given to them, Ainz Ooal Gown, Tanya Degurechaff, Kazuma Satou, Subaru Natsuki, and the other members of Class 2 are surprised to find out that their role as students is far from over. With no means of returning home, the class of eccentric personalities is still mysteriously stuck in the unfamiliar world. Although, as they are becoming quite fond of each other, spending more time together does not sound that bad. With the unexpected arrival of new transfer students, the comedic antics of our beloved characters continue to grow. Thus, their bizarre yet nonchalant school life continues. [Written by MAL Rewrite]\nStudio Studio PuYUKAI\nSource Original\nThemes Isekai Parody\n7.36\n246K\nAdd to My List",
      "metadata": {
        "doc_index": 116,
        "header_level": 2,
        "header": "## Isekai Quartet 2",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Meikyuu Black Company\nTV, 2021 Finished 12 eps, 23 min\nComedy Fantasy\nMeikyuu Black Company\nAfter working tirelessly toward his goal of a self-sustainable NEET lifestyle, Kinji Ninomiya has finally achieved his dreams. Now looking down on common folk commuting during a typhoon from the penthouse of one of his apartment buildings, Kinji gets ready to start his new, slothful life. However, all of his hard work goes to waste when a portal appears beneath him from out of nowhere. Teleported to another world, Kinji is forced to work for a mining company that focuses solely on profits and has no care whatsoever for the safety and well-being of its employees. Refusing to live in such conditions, he begins devising plans to get rich quickly, building connections with others in this new world and making his best efforts to escape the stringent corporate life. Will Kinji be able to overcome his restraints and attain financial freedom once more? [Written by MAL Rewrite]\nStudio SILVER LINK.\nSource Web manga\nTheme Isekai\n7.22\n243K\nAdd to My List",
      "metadata": {
        "doc_index": 117,
        "header_level": 2,
        "header": "## Meikyuu Black Company",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Kami-tachi ni Hirowareta Otoko\nTV, 2020 Finished 12 eps, 23 min\nFantasy Slice of Life\nKami-tachi ni Hirowareta Otoko\nDeep in the forest, far from any human contact, there lives a child named Ryouma Takebayashi. He engages in the rather strange hobby of keeping various types of slimes as pets. Furthermore, despite his young age, he has a sturdy physique and good compatibility for magic. All of this is because, having endured much hardship in his previous life, three gods grace Ryouma with a second chance to pursue one goal: savor the wonders of life. After three years of comfortable solitude pass by, Ryouma meets people that will change his current life forever. When he encounters and helps some soldiers tend to their wounded comrade, the group convinces him to accompany them to visit the nearby town's ducal family. Ryouma agrees and soon embarks on a journey to explore the vast world beyond his home. [Written by MAL Rewrite]\nStudio Maho Film\nSource Light novel\nThemes Isekai Iyashikei Reincarnation\n6.97\n239K\nAdd to My List",
      "metadata": {
        "doc_index": 118,
        "header_level": 2,
        "header": "## Kami-tachi ni Hirowareta Otoko",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen 2nd Season - 1 ## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen 2nd Season\nTV, 2020 Finished 12 eps, 23 min\nFantasy\nHonzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen 2nd Season\nWhen Myne learns that the Holy Church is in need of mana for their relics, she sees it as her chance to be cured of her life-threatening mana disorder.\nAfter seeing their bountiful library, she throws herself headfirst into the Church's grasp and begs to join their order.\nIn exchange for her service and her unusually bountiful supply of mana, Myne is given the blue robes of a noble-born apprentice priestess, despite being a commoner.\nTo Myne, all this talk of mana and nobility is trivial, as she now has access to an unlimited supply of books!\nAs Myne transitions into the next phase of her life in this new world, she soon learns that achieving her dream has come at a heavy cost.\nNoble society is severe, unforgiving, and fueled by politics and neglect.\nShe must now deal with the class conflict between the noble-born blue robes and the common-born grey robes, the High Priest's attempts to oust her, and constant behavioral issues from her new retainers.",
      "metadata": {
        "doc_index": 119,
        "header_level": 2,
        "header": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen 2nd Season - 1 ## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen 2nd Season",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen 2nd Season - 8 With the help of her family, friends, and the enigmatic Head Priest whose loyalties and motives remain unknown, Myne seeks to overcome these obstacles and continue on the path to becoming her ideal self--the ultimate librarian!\n[Written by MAL Rewrite]\nStudio Ajia-do\nSource Light novel\nThemes Isekai Reincarnation\n8.08\n235K\nAdd to My List",
      "metadata": {
        "doc_index": 120,
        "header_level": 2,
        "header": "## Honzuki no Gekokujou: Shisho ni Naru Tame ni wa Shudan wo Erandeiraremasen 2nd Season - 8 With the help of her family, friends, and the enigmatic Head Priest whose loyalties and motives remain unknown, Myne seeks to overcome these obstacles and continue on the path to becoming her ideal self--the ultimate librarian!",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei Kenja no Isekai Life: Dai-2 no Shokugyou wo Ete, Sekai Saikyou ni Narimashita\nTV, 2022 Finished 12 eps, 24 min\nAction Adventure Fantasy\nTensei Kenja no Isekai Life: Dai-2 no Shokugyou wo Ete, Sekai Saikyou ni Narimashita\nAfter working himself to death in a hostile corporate environment, Yuuji Sano gets a second chance when he transmigrates to a game-like fantasy world. Although he wishes to lead an unassuming life, Yuuji learns that he has the title of a Monster Tamer, the weakest rank of adventurer. With his newfound skills, he tames a number of slimes around him and, with their help, acquires magical powers to become a Sage--a second profession that capitalizes on such potential. Even after gaining overwhelming strength, the scars from the life Yuuji left behind keep him from going all out. However, he might not be able to hide his abilities for much longer, as unforeseen dangers threaten to destroy the world that is now his only home. [Written by MAL Rewrite]\nStudio Revoroot\nSource Light novel\nTheme Isekai\n6.33\n235K\nAdd to My List",
      "metadata": {
        "doc_index": 121,
        "header_level": 2,
        "header": "## Tensei Kenja no Isekai Life: Dai-2 no Shokugyou wo Ete, Sekai Saikyou ni Narimashita",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Tensei shitara Slime Datta Ken Movie: Guren no Kizuna-hen\nMovie, 2022 Finished 1 ep, 108 min\nAction Comedy Fantasy\nTensei shitara Slime Datta Ken Movie: Guren no Kizuna-hen\nIn Raja, a small country located to the west of Tempest. Rimuru and his companions get involved in a long-running conspiracy that swirls around the mysterious power of the queen. Rimuru and his commander Benimaru also encounter another ogre survivor named Hiiro, a man that used to be the brother of Benimaru. (Source: ANN)\nStudio 8bit\nSource Manga\nThemes Isekai Reincarnation\nDemographic Shounen\n7.62\n230K\nAdd to My List",
      "metadata": {
        "doc_index": 122,
        "header_level": 2,
        "header": "## Tensei shitara Slime Datta Ken Movie: Guren no Kizuna-hen",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Digimon Adventure 02\nTV, 2000 Finished 50 eps, 25 min\nAction Adventure Comedy Fantasy\nDigimon Adventure 02\nTaichi Yagami and his friends have moved on to junior high, but by that time, they have lost contact with their Digimon partners.\nTaichi is therefore surprised to suddenly receive a distress call summoning him to the Digital World.\nOnce there, he learns that Digimon are living in fear of the mysterious Digimon Emperor, who is somehow suppressing their ability to Digivolve!",
      "metadata": {
        "doc_index": 123,
        "header_level": 2,
        "header": "## Digimon Adventure 02",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Digimon Adventure 02 - 4 In the real world, Hikari Yagami and Takeru Takaishi reunite in the same fifth grade class.\nThey share three schoolmates: Daisuke Motomiya, who reminds them both of Taichi; Miyako Inoue, a technical wizard; and Iori Hida, Miyako's neighbor.\nWhen these three children receive \"D-3\" Digivices, they--along with Hikari and Takeru, who still possess their own original Digivices--comprise the new generation of \"Chosen Children\" who must save the world once again.\nWith the power of the Armored Digi-Eggs, they must thwart the Digimon Emperor's plans to spread his influence over the entire Digital World.\n[Written by MAL Rewrite]\nStudio Toei Animation\nSource Original\nTheme Isekai\nDemographic Kids\n7.24\n228K\nAdd to My List",
      "metadata": {
        "doc_index": 124,
        "header_level": 2,
        "header": "## Digimon Adventure 02 - 4 In the real world, Hikari Yagami and Takeru Takaishi reunite in the same fifth grade class.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Seijo no Maryoku wa Bannou desu\nTV, 2021 Finished 12 eps, 23 min\nFantasy Romance\nSeijo no Maryoku wa Bannou desu\nSince ancient times, the citizens of Slantania have lived within a shroud of miasma, a force that brings forth monsters creating havoc around the world.",
      "metadata": {
        "doc_index": 125,
        "header_level": 2,
        "header": "## Seijo no Maryoku wa Bannou desu",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Seijo no Maryoku wa Bannou desu - 2 When the kingdom's Order of Knights becomes incapable of containing the monsters, the Grand Magus summons a holy maiden--the legendary \"Saint\"--to obliterate the horrid creatures and restore peace.\nOne evening, as Sei Takanashi returns home from a long day at work, a magical force pulls her into a foreign world.\nUpon her arrival to the kingdom of Slantania, she overhears that the Grand Magus inadvertently summoned two Saints--Sei and a brown-haired girl.\nNeeding only one holy maiden, the prince declares the other girl as the Saint, leaving Sei to her own devices.\nSei sets her sight on the Medicinal Flora Research Institute, an establishment known for its studies regarding herbs and potions.\nWhile indulging in her latest passion, Sei has a fateful encounter with the commander of the Third Order of Knights.\nBut little does she know, her aptitude as a Saint will continue to exert its influence over her new life.\n[Written by MAL Rewrite]\nStudio Diomedea\nSource Light novel\nThemes Isekai Medical\n7.31\n228K\nAdd to My List",
      "metadata": {
        "doc_index": 126,
        "header_level": 2,
        "header": "## Seijo no Maryoku wa Bannou desu - 2 When the kingdom's Order of Knights becomes incapable of containing the monsters, the Grand Magus summons a holy maiden--the legendary \"Saint\"--to obliterate the horrid creatures and restore peace.",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei - 1 ## Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei\nTV, 2021 Finished 12 eps, 23 min\nAdventure Fantasy Romance\nShinka no Mi: Shiranai Uchi ni Kachigumi Jinsei\nOne day, a man claiming to be a god suddenly hacks a certain school's intercoms, ordering all of its students to team up and prepare to be transported to another world.\nThere, they will be given special skills in the hopes that they become that world's heroes and defeat the Demon King that ravages the land.\nThe initial transfer is a success.\nHowever, Seiichi Hiiragi, who suffers from his classmates' constant bullying due to his somewhat undesirable appearance, is left behind as no one is willing to be his teammate.\nNevertheless, the self-proclaimed god decides to send Seiichi to the parallel world and lets him join his peers.\nUnfortunately, this fateful ordeal causes Seiichi to arrive at a location deep in the forest, far not only from his schoolmates but from human civilization as well.\nDesperately searching for a way to change his predicament, Seiichi's miserable days only seem to continue to worsen.\nYet when all hope seems lost, Seiichi discovers a strange fruit known as the \"Fruit of Evolution\"--which may be his first step toward a significantly better future.",
      "metadata": {
        "doc_index": 127,
        "header_level": 2,
        "header": "## Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei - 1 ## Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei - 9 [Written by MAL Rewrite]\nStudio Hotline\nSource Light novel\nThemes Harem Isekai\n6.17\n228K\nAdd to My List",
      "metadata": {
        "doc_index": 128,
        "header_level": 2,
        "header": "## Shinka no Mi: Shiranai Uchi ni Kachigumi Jinsei - 9 [Written by MAL Rewrite]",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "## Mushoku Tensei II: Isekai Ittara Honki Dasu - Shugo Jutsushi Fitz\nTV Special, 2023 Finished 1 ep, 24 min\nAdventure Drama Fantasy Ecchi\nMushoku Tensei II: Isekai Ittara Honki Dasu - Shugo Jutsushi Fitz\nIn the immediate aftermath of the mana calamity, Sylphiette finds herself teleported to the heart of the Asura Kingdom: the royal palace. Her sudden appearance accidentally saves the life of second princess Ariel Anemoi Asura, who has her sights set on becoming the ruler of the realm. Witnessing Sylphiette's talent with combat magic firsthand, Ariel recruits her as her bodyguard and right-hand woman, commencing their journey to power--which proves far more treacherous than first imagined. [Written by MAL Rewrite]\nStudio Studio Bind\nSource Light novel\nThemes Isekai Reincarnation\n7.53\n217K\nAdd to My List\n1 - 100 101 - 200 201 - 300 301 - 400 ... 401 - 429",
      "metadata": {
        "doc_index": 129,
        "header_level": 2,
        "header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu - Shugo Jutsushi Fitz",
        "parent_header": "# Isekai Anime"
      }
    },
    {
      "tokens": 133,
      "text": "### More Top Anime\n1. 1 Sousou no Frieren\n2. 2 Fullmetal Alchemist: Brotherhood\n3. 3 Steins;Gate\n4. 4 Shingeki no Kyojin Season 3 Part 2\n5. 5 One Piece Fan Letter",
      "metadata": {
        "doc_index": 130,
        "header_level": 3,
        "header": "### More Top Anime",
        "parent_header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu - Shugo Jutsushi Fitz"
      }
    },
    {
      "tokens": 133,
      "text": "### More Top Airing Anime\n1. 1 Kusuriya no Hitorigoto 2nd Season\n2. 2 One Piece\n3. 3 Tu Bian Yingxiong X\n4. 4 Tian Guan Cifu Short Film\n5. 5 Doupo Cangqiong: Nian Fan",
      "metadata": {
        "doc_index": 131,
        "header_level": 3,
        "header": "### More Top Airing Anime",
        "parent_header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu - Shugo Jutsushi Fitz"
      }
    },
    {
      "tokens": 133,
      "text": "### More Most Popular Characters\n1. 1 Lamperouge, Lelouch\n2. 2 Monkey D., Luffy\n3. 3 Levi\n4. 4 Lawliet, L\n5. 5 Roronoa, Zoro\nHome\nAbout Press Room Support Advertising FAQ Terms Privacy Privacy Settings Do Not Sell or Share my Personal Information Cookie Notice at Collection Sitemap\nLogin Sign Up\nTokyo Otaku Mode Honeyfeed Manga Store\nMyAnimeList.net is a property of MyAnimeList Co., Ltd. (c)2025 All Rights Reserved.\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.",
      "metadata": {
        "doc_index": 132,
        "header_level": 3,
        "header": "### More Most Popular Characters",
        "parent_header": "## Mushoku Tensei II: Isekai Ittara Honki Dasu - Shugo Jutsushi Fitz"
      }
    }
  ]
}
